{
  "title": "Allyson Jeffredo",
  "description": "Allyson Jeffredo is a poet, writer, and educator from the Coachella Valley. Her work explores topics such as mental illness and healing and can be found in places such as Press Enterprise, Cider Press Review, Lunch Ticket, and others. She currently works with library literacy programs across California, teaches English languages classes, leads creative writing workshops, and offers one-on-one life and writing coaching.",
  "content": "I didn't always love reading or writing. Growing up, I rarely even had books in my home. But, thanks to the great storytellers in my family, my life was rich in stories. My dad could make his day digging up and replacing sprinkler heads an epic worthy of Homer. My grandma has an amazing collection of myths memorized, like explaining why cats flick the tips of their tail. The devil made a deal with the cat: If the devil could count each hair on the tip of the cat's tail, the devil would get his soul; If the devil couldn't do it, the cat would get nine lives in return. Spoiler: Each time the devil was counting the final hairs, the cat would flick the tip of his tail causing the devil to lose count. The devil frustrated and eventually gave up in defeat, and cats continue to smugly flick their tails in victory. The drama my cousin brings to every story, like his friend taking a chipful of some spicy salsa and yelling, \"Puta madre se me enchiló,\" as she died from the burn would have any room cracking up. \n\nMy life wouldn't be the same if it wasn't for these stories.\n\nIn high school, it wasn't much of a leap for my love of stories to begin transitioning into a passion for reading and writing. After my dad died the month after I graduated high school, I ended up staying in the desert and attending my local community college. I didn't know it then, but it was the best decision I could've made. It was in college that my love for language really flourished thanks to a handful of incredible professors and the fortune of unique and intimate classrooms. In most of my upper division undergraduate classes, there was no more than 12 students. All of us grew close as we covered literary criticism like Sigmeund Freud and Simone de Beauvoir, poets like Wendell Berry, Lorna Dee Cervantes, and Simon Ortiz, writers like Louise Ehrdrich and Edith Wharton, and countless others. My life was full of beautiful, thoughtful, challenging, exciting words that formed ideas that expanded on and challenged everything I thought I knew.\n\nDuring graduate school, in addition to the continuation of incredible and challenging readings and time dedicated to writing, I began teaching. For years I thought teaching was a sign of failure. Years earlier an old boyfriend told me, \"Those who can, do. Those who can’t, teach,\" when he learned that I wanted to teach. It may come to no surprise that I immediately learned that teaching is hard. To be a good teacher is even harder. Since then, I've taught all kinds of people from all kinds of backgrounds and experiences, and it's still one of the hardest and most fullfilling things I do. \n\nAfter the death of my dad, I fell into so many choices of my life by chance. With the immense privilege and good fortune, I'm here today able to do the things I love: teach, write, read, spent time with my loved ones and animals, and sometimes all of these come together to form sheer moments of bliss that I'm gald I get to share with you.\n\nIf you find yourself unsure of the direction of an essay, looking for direction in life or for a group of poems, or desiring one-on-one supportfor a larger project, contact me for a free consultation.",
  "greeting": "Allyson Jeffredo",
  "tagline": "Poet. Writer. Educator.",
  "profile_image": "/uploads/profile.jpg",
  "keywords": [
    "Writing",
    "literature",
    "editing",
    "life"
  ]
}