{
  "title": "The Beloveds: An Online Book Club",
  "description": "The Beloveds: An Online Book Club homepage.",
  "content": "In bell hooks' pedagogical text, *Teaching Community*, she uses the phrase \"beloved community\" to highlight pedagogical approaches, behaviors and mindsets that do not cultivate a \"beloved community.\" A phrase made famous by Dr. Martin Luther King's vision for the black community, hooks defines \"beloved community\" as \"... formed not by the eradication of difference but by its affirmation, by each of us claiming the identities and cultural legacies that shape who we are and how we live in the world\" (hooks, *Killing Rage: Ending Racism*). Reading books closely is an intimate tool to both better see ourselves and those around us. To do this, we must read texts by those who are like us and different from us combined with conscious, thoughtful discussion to bring each text to life.\n\nInspired by this idea of beloved communities, The Beloveds is a monthly online book club for book lovers looking to love books with other book lovers by discussing beauty and hurt and identity and pain and everything in between. Though we will feature a \"diverse\" book every month, I don't want to contribute to the compartmentalizing of literature by people of color; I'd rather it just be a norm. So, this is merely a book club discussing all kinds of rich books.\n\n*The Setup*: On the second Monday of each month, we’ll have a virtual meetup on [Zoom](https://zoom.us/download) at 7:00 pm to discuss the book-of-the-month. To get the Zoom link, please send me an email at [hello@allysonjeffredo.com ](mailto:hello@allysonjeffredo.com)that includes your full name you’d like to use to register. If we don’t know eachother personally, please also include a link to a social media. \n\nUp until the time of the monthly meeting, we can discuss the book via our Facebook group. During the month, a poll will be available to choose the next book of the month—final selection will be announced at the end of the monthly virtual meetup. At 7:00 pm of each 2nd Monday of the month, you'll click on the Zoom link to take part in a video discussion about the monthly book. If you don't have Zoom, you'll have to download the app to your device. To download, click [here](https://zoom.us/download).",
  "keywords": [
    "Writing",
    "literature",
    "editing",
    "life"
  ],
  "poll_link": "https://forms.gle/neP57w2epHJtsbeR6"
}