{
  "data": [
    {
      "publish_date": "2021-08-28T00:04:37.392Z",
      "month": "2022-12-28T01:03:42.362Z",
      "title": "Velvet Was the Night",
      "author": {
        "name": "Silvia Moreno-Garcia",
        "website": "https://silviamoreno-garcia.com"
      },
      "image": "/uploads/velvetwasthenight.jpg",
      "description": "If there is a new book by Silvia Moreno-Garcia, I’ll most definitely read it. The latest being *Velvet Was the Night*. A noir set in 1970s Mexico City during a turbulent time of government corruption, fears of communism, and students fighting for a freer world, *Velvet Was the Night* is told through a revolving perspective of two main characters: Maite and Elvis.\n\n \n\nMaite is a 30-year-old secretary who lives a solitary life absorbed in romance comics and records. Elvis is a 21-year-old “Hawk,” an underground organization of youth paid by the government to infiltrate student-led groups and disrupt protests. Maite and Elvis are brought together by the disappearance of Maite’s neighbor, Leonora, and the mysterious and dangerous photos she’s carrying that could undermine the Hawks and their leader, El Mago. The reader is taken through a third-eye-view as Maite and Elvis attempt to find Leonora, locate these pictures, and stay alive.\n\n \n\nBecause of the time and setting, there’s a few key perspectives that intertwine and collide throughout *Velvet Was the Night*:\n\n* Those who are indifferent to the political climate in some way—as embodied by Maite’s and Elvis’ indifference to the political atmosphere (even though their indifference stems from different sources)\n* Those who choose to be politically active for positive change—as embodied by Rubén and the Asterisks \n* Those who choose to play politics for self-gain—as embodied by the puppeteers El Mago, Anaya and other briefly-mentioned government officials \n\nThe underlying tension between these three political perspectives are the driving force for the book. Each of these characters, regardless of how willful they are, are sucked into the political environment, which is a great extended metaphor for politics. Regardless of the level of activity one chooses, a person can never be truly neutral or even apolitical because the larger political landscape seeps into even the every(wo)man’s life like Maite—which recalls the saying, “Being apolitical is political.” This is something that Rubén frequently reminds Maite as they work together, but it is also something that Maite never quite seems to realize, leading to my biggest criticism of the book.\n\n \n\n*Velvet Was the Night* would not pass the [Bechdel Test](mailto:https://global.oup.com/us/companion.websites/9780199315468/student/ch7/wed/test/). Maite is so concerned about being attractive, getting old, and being alone. She frequently goes off into reveries of her fantasies fueled by romance comics like *Secret Romance*. Maite’s insecurities may be the most painful to read over and over throughout the book. The comments on Maite’s beauty (or lack of) both by Maite herself and the men in the book sometimes distract from the actual plot. Even though Maite has done so much for herself, Maite’s self-deprecation is a reoccurring focal point of the book. Maite has a steady job, bought herself a car, and lives on her own. Despite her struggles, Maite never seems able to appreciate all she has attained because her life and her looks don’t mirror the romance novels she obsessively follows. In some ways, the romance novel acts as a distraction for both the political tension and lack of familial support and disappointment Maite faces from her mother and sister. However, until the very end of the book, Maite does not seem able to enjoy the life she has created for herself because of this internal narrative, and most likely larger societal pressures faced by Latinas of the time. Like Maite fails to observe the larger political strife, she also fails to observe the large gender norms. The lack of growth the reader fails to see in Maite’s perspective of the world and, most importantly, of herself is perhaps the true tragedy.\n\n \n\nOverall, *Velvet Was the Night* is entertaining and provides some insight into a turbulent time of Mexico’s history as well as references to great oldies. The characters embody interesting political perspectives that captures attitudes of the time that could easily be applied to individual political attitudes today. However, if you’re like me, it might be difficult and somewhat triggering to sit with a main character like Maite that thinks so little of herself—especially because she experiences very little growth by end.",
      "tags": [
        "noir",
        "detective",
        "mystery"
      ]
    }
  ]
}