{
  "data": [
    {
      "publish_date": "2021-08-28T00:04:37.392Z",
      "month": "2022-12-28T01:03:42.362Z",
      "title": "Velvet Was the Night",
      "author": {
        "name": "Silvia Moreno-Garcia",
        "website": "https://silviamoreno-garcia.com"
      },
      "image": "/uploads/velvetwasthenight.jpg",
      "description": "If there is a new book by Silvia Moreno-Garcia, I’ll most definitely read it. The latest being *Velvet Was the Night*. A noir set in 1970s Mexico City during a turbulent time of government corruption, fears of communism, and students fighting for a freer world, *Velvet Was the Night* is told through a revolving perspective of two main characters: Maite and Elvis.\n\nMaite is a 30-year-old secretary who lives a solitary life absorbed in romance comics and records. Elvis is a 21-year-old “Hawk,” an underground organization of youth paid by the government to infiltrate student-led groups and disrupt protests. Maite and Elvis are brought together by the disappearance of Maite’s neighbor, Leonora, and the mysterious and dangerous photos she’s carrying that could undermine the Hawks and their leader, El Mago. The reader is taken through a third-eye-view as Maite and Elvis attempt to find Leonora, locate these pictures, and stay alive.\n\nBecause of the time and setting, there’s a few key perspectives that intertwine and collide throughout *Velvet Was the Night*:\n\n* Those who are indifferent to the political climate in some way—as embodied by Maite’s and Elvis’ indifference to the political atmosphere (even though their indifference stems from different sources)\n* Those who choose to be politically active for positive change—as embodied by Rubén and the Asterisks \n* Those who choose to play politics for self-gain—as embodied by the puppeteers El Mago, Anaya and other briefly-mentioned government officials \n\nThe underlying tension between these three political perspectives are the driving force for the book. Each of these characters, regardless of how willful they are, are sucked into the political environment, which is a great extended metaphor for politics. Regardless of the level of activity one chooses, a person can never be truly neutral or even apolitical because the larger political landscape seeps into even the every(wo)man’s life like Maite—which recalls the saying, “Being apolitical is political.” This is something that Rubén frequently reminds Maite as they work together, but it is also something that Maite never quite seems to realize, leading to my biggest criticism of the book.\n\n*Velvet Was the Night* would not pass the [Bechdel Test](https://global.oup.com/us/companion.websites/9780199315468/student/ch7/wed/test/). Maite is so concerned about being attractive, getting old, and being alone. She frequently goes off into reveries of her fantasies fueled by romance comics like *Secret Romance*. Maite’s insecurities may be the most painful to read over and over throughout the book. The comments on Maite’s beauty (or lack of) both by Maite herself and the men in the book sometimes distract from the actual plot. Even though Maite has done so much for herself, Maite’s self-deprecation is a reoccurring focal point of the book. Maite has a steady job, bought herself a car, and lives on her own. Despite her struggles, Maite never seems able to appreciate all she has attained because her life and her looks don’t mirror the romance novels she obsessively follows. In some ways, the romance novel acts as a distraction for both the political tension and lack of familial support and disappointment Maite faces from her mother and sister. However, until the very end of the book, Maite does not seem able to enjoy the life she has created for herself because of this internal narrative, and most likely larger societal pressures faced by Latinas of the time. Like Maite fails to observe the larger political strife, she also fails to observe the large gender norms. The lack of growth the reader fails to see in Maite’s perspective of the world and, most importantly, of herself is perhaps the true tragedy.\n\nOverall, *Velvet Was the Night* is entertaining and provides some insight into a turbulent time of Mexico’s history as well as references to great oldies. The characters embody interesting political perspectives that captures attitudes of the time that could easily be applied to individual political attitudes today. However, if you’re like me, it might be difficult and somewhat triggering to sit with a main character like Maite that thinks so little of herself—especially because she experiences very little growth by end.",
      "tags": [
        "noir",
        "detective",
        "mystery"
      ]
    },
    {
      "publish_date": "2022-08-06T07:00:00.000Z",
      "month": "2023-01-07T03:31:25.777Z",
      "title": "The Many Daughters of Afong Moy",
      "author": {
        "name": "Jamie Ford",
        "website": "https://jamieford.com"
      },
      "image": "/uploads/tmdoam.jpg",
      "description": "I picked up Jamie Ford’s *[The Many Daughters of Afong Moy](https://bookshop.org/p/books/the-many-daughters-of-afong-moy-jamie-ford/17805412?ean=9781982158217)* from a recommendation by [@latinarebels](https://www.instagram.com/latinarebels/?hl=en) on Instagram, and I was not disappointed. *The Many Daughters of Afong Moy* spans almost 250 years and over seven generations of Afong Moy and her family’s lives as they navigate forced immigration, social expectations, violence, identity, and the reconciliation of the trauma they and their ancestors have faced. The overarching exploration of this book brilliantly captures the [transgenerational epigenetic inheritance](https://news.ucsc.edu/2022/09/epigenetic-inheritance.html), the transgenerational trauma that is inevitably passed from one person to another, and the way this trauma lives in the body and shapes who we are. Thankfully, Ford doesn’t just leave us with a depiction of trauma and its inheritance, he also imagines a future where deep healing from transgenerational trauma is possible. \n\n![Afong Moy (1842): Lai King (1892) - Granddaughter Afong Moy, Zoe / Zou Yi (1927) - Daughter of Lai King, Faye / Fei-jin (1942) - Daughter of Zoe, Greta (2014) - Great(?) grandaughter of Faye, Dorothy (2045) - Daughter of Greta, Annabel (2086) - Daughter of Dorothy](/uploads/moyfam.png \"The Family of Afong Moy\")\n\nIn a series of short stories organized nonchronologically, the reader is slowly presented the intertwined stories of Afong, Lai King, Zoe, Faye, Greta, Dorothy, and Annabel. The nonchronological order captures a natural rhythm of storytelling while also depicting the non-linear impact of trauma. As the reader makes their way through each chapter, the sequence of the book emphasizes the “echoes,” as a later chapter is titled, of each woman’s story within another’s. Sometimes these “echoes” are actual visions of another timeline and other “echoes” are similar events, such as Dorothy realizing her daughter is drawing the same exact plane, possibly [a P-40 flown by Americans hired by China during WWII](https://www.npr.org/2021/12/19/1062091832/flying-tigers-americans-china-world-war-ii-history-japan), Dorothy drew as a girl.\n\nThroughout the book, Ford does a brilliant job capturing the painful paradox of those living with the aftereffects of trauma. Often those with past trauma want the trauma to remain buried and forgotten, like Lai King when she thinks about losing her mother, father, and home to the plague, “Lai King’s heart ached for all the things she wished she could forget.” Because our body wants to protect us, the memory of these painful experiences become ingrained in our bodies to help us avoid future pain if possible. The exact opposite of what Lai King, and most of us, want. If one can work through the pain, though, there is also some freedom in learning about our history and the intricate factors that have shaped who we are. In *Afong Moy*, Dorothy’s therapist recommends an experimental trial of epigenetic therapy led by Dr. Shedhorn. Dr. Shedhorn has developed a process that allows patients to identify and explore their transgenerational epigenetic inheritance and the accompanying trauma to address anxiety, depression, PTSD, and other mental illnesses that may be linked to this trauma. When Dorothy’s partner asks how her sessions are going, Dorothy thinks: “…feeling okay after a lifetime of feeling everything—rage, grief, anxiety, sadness, confusion, disconnection, and longing—to just feel okay was as wonderful as it was unfamiliar. She felt intoxicated by normality.” Though the lived and remembered trauma is painful, processing the trauma and finding some sense of “normality” is a blessing. Something those of us who’ve gone through or are currently undergoing therapy can certainly agree with.\n\nOne of the most captivating parts of *Afong Moy* is the constant emphasis of interconnectedness. Here, interconnectedness is not so much rebirth, but a thread of deep connection between generation. A thread that points to death as a shift in existence. At first, Dorothy thinks of this interconnectedness as a dilution of the self, “Dorothy imagined herself as a copy of a copy of a copy. Each version less sharp, less clear, more muddy, blurry around the edges of happiness and contentment.” However, Dr. Shedhorn explains to Dorothy that “each generation is built upon the genetic ruins of the past. That our lives are merely biological waypoints. We’re not individual flowers, annuals that bloom and then die. We’re perennials. A part of us comes back each new season, carrying a bit of the genus of the previous floret.” In this context, the self is a confluence of the individual, our ancestors, and the seemingly infinite events that have led to our existence with almost unbelievable precision. The only part that makes any of this miraculous occurrence believable is the unlikely fact we’re here. Each of us only new in form but ancient in content; always carrying a part of the past.\n\n*The Many Daughters of Afong Moy* underscores the beauty of the interconnectedness within and amongst each other, but it also emphasizes the weight of this responsibility for each new generation. From the time Afong Moy is sent to America by her dead husband’s family in 1842, each of Afong’s relatives had to carry the weight of their past along with their own. Not until over 200 years had passed, during Dorothy’s time in 2045, did any of Afong’s family members have the tools to safely and effectively process the trauma the prior generations experienced to finally break the cycle. And this reality, hoping that our children and our children’s children will have more than us, have better than us, is a bittersweet thread that links these stories together. It brings a deeper understanding to all the pain our ancestors experienced—even those from recent generation—with little to no access to proper care and healing.\n\n*The Many Daughters of Afong Moy* is powerful, successfully navigates a wide breadth of time, and fruitfully portrays complex themes. Lai King says, “‘Ghosts aren’t always bad. Sometimes they’re just our ancestors checking in on us.’” The ghosts of the past surround us, and their echoes reverberate within the microcosm of the self ultimately shaping who we are. If we’re lucky, we might even see a ghost or two, and welcome them.",
      "tags": [
        "novel",
        "trauma",
        "family",
        "time"
      ]
    },
    {
      "publish_date": "2022-08-19T00:17:25.767Z",
      "month": "2023-01-19T01:16:09.784Z",
      "title": "Witches",
      "author": {
        "name": "Brenda Lozano and Heather Cleary"
      },
      "image": "/uploads/witches.jpg",
      "description": "*[Brujas](https://bookshop.org/p/books/brujas-witches-brenda-lozano/14484399?ean=9786073189194)* is the second book I’ve read by Brenda Lozano, who is easily becoming one of my favorite authors. *Brujas,* or its English translation, *[Witches](https://bookshop.org/p/books/witches-brenda-lozano/17837989?ean=9781646220687)*,is a novel about a young journalist, Zoe, who is interviewing a famous curandera, Feliciana, from San Felipe, Oaxaca, Mexico, after Zoe learns about the death of Feliciana’s cousin, Paloma. Throughout the interview with Feliciana, Zoe learns as much about herself as she learns about the journey of Feliciana and Paloma. Feliciana is the first female-born curandera in a long line of curanderos who is taught the ways of the \"Language” by Paloma, also a curandera and a person who identifies as [Muxe](https://nhm.org/stories/beyond-gender-indigenous-perspectives-muxe), the name for the third-gender people of the [Zapotec](https://indigenousmexico.org/oaxaca/the-mixtecs-and-zapotecs-two-enduring-cultures-of-oaxaca/), an indigenous people from Oaxaca, Mexico. *Brujas* does a wonderful job exploring many intricate themes, such as language, self-exploration, inheritance, gender and gender identity, indigeneity, love, colonization, violence, and so many others. Each theme seamlessly integrated into the novel takes the reader on an everchanging exploration of life.\n\n*Brujas* is told through the converging narratives of Feliciana and Zoe. Two women from different upbringings brought together by the death of Paloma. Even though both women’s lives are distinctly different, the juxtaposition of their stories reveals the echo, the connection we have with another that is more similar than different. Throughout the novel, Feliciana and Zoe take turns divulging their life stories. The interchanging narrative structure is explained in part by Zoe, “I came to understand that you can’t really know another woman until you know yourself.” This is Zoe’s introduction to the self-exploration and self-discovery she experiences as the book unfolds. Though Zoe’s story is important, Feliciana’s and Paloma’s stories are the foci of the book.\n\nZoe’s story is told in a traditional linear narrative of her growing up as the eldest daughter with a father who was silent but trustworthy, a mother who couldn’t keep anything to herself, and a sister who couldn’t be anything but herself. Because of her sister’s wildness, Zoe felt the need to choose a life that she thought was expected of her, “In my role as firstborn, I hadn’t allowed myself to do what I wanted—I’d always done what I thought I should do.” Zoe’s realization is revealed with the help of Feliciana and the “Children,” the [hallucinogenic mushrooms](https://www.brown.edu/campus-life/health/services/promotion/alcohol-other-drugs-other-drugs/psilocybin-mushrooms) Feliciana uses to conduct her ceremonies. With the help of the Children, Feliciana unearths and releases the “deep waters,” the inner most self of one’s self, using the power of the “Language” and the “Book,” “On the third night, Feliciana gave me four pairs of mushrooms and guided me with the Language, she read me a page from the Book. This is yours, \\[Feliciana] said, this is your page and these words of the Language are yours, Zoe. This is the page you were missing.” In Feliciana’s ceremonies, she guides individuals like Zoe through the ceremony to help them discover their “deep waters,” which offers the person a chance to heal and find peace from the guilt they carry.\n\nFeliciana’s narrative, however, is markedly distinct. First, Feliciana is being translated from her original Zapotec to Spanish (and then into English if you’re reading the English version, *Witches*). Yet, the writing captures the non-linear, elliptical nature of Feliciana’s oral storytelling which resonates with Feliciana’s description of nature, “…nature has the answers to the ills we suffer, you just have to watch the circles time moves in to understand our nature, the nature of people.” Feliciana’s story folds into itself. It moves forward and backward in a way that creates an echo, a feeling of “Why does this seem so familiar?” Feliciana’s narration builds and builds making sure not to leave the reader/listener behind:\n\n> “…I don’t know when I was born because I was born like the mountain was, go as the mountain when it was born, but I know it was six at night when Guadalupe came to say they killed Paloma as she was getting ready to go out…” (Chapter 1)\n>\n> “I don’t know times, I don’t know dates, I don’t know when I was born so don’t ask me that because I don’t know, but I know that terrible hour…I knew that man had killed her with a dagger in her back from his rage at Paloma for being Muxe…” (Chapter 19)\n\n In Feliciana’s elliptical style, we learn about her journey, but, simultaneously, the journey of Paloma, who doesn’t carry guilt and brings ease to those around her, “People laughed with \\[Paloma] and they went to her because she was good at giving advice about love….” Despite the good that Paloma was able to bring into the world, she’s killed because someone could not see past her identity as Muxe. In this way, the book is centered around prejudice and gender-based violence beginning with Paloma’s murder to Feliciana’s own experiences with domestic violence to Leandra’s, Zoe’s sister, sexual assault. \n\nAnother powerful theme throughout the book is Feliciana’s rejection of colonization and her dedication to preserving her culture, “I speak only my tongue, this tongue that reaches you through an interpreter, this tongue that is the tongue of my ancestors. I will not end my tongue with any other because this tongue is who I am, it is the tongue of my ancestors and this tongue is who I am, I honor who I am when I speak it.” Throughout *Brujas*, it is clear that colonization has stolen and erased so much of what made us whole. The mindset of the colonized people Feliciana encounters causes them to refuse to learn from those who are still so connected to the “deep waters” of tradition and nature like Feliciana. These people come from around the world to learn from her about the Children, “It’s the other way around, the mushrooms take care of you, bring them with you so they can take care of you in Japan for me. And the Japanese men laughed…they didn’t understand what I was telling them.” These powerful people come to learn from Feliciana, who generously shares her rituals, yet they laugh and disregard her generosity and wisdom instead of listen.\n\nWhen someone asked me recently for self-help book recommendations, I realized I don’t read any, and I don’t need to because books like *Brujas* not only teach readers so much about life but provide the reader with the gift of a new perspective in a way that only a book can by building an intimate connection between reader and subject. So intimate, sometimes it’s hard to distinguish who needs who to survive, the reader to bring the subject to life or the subject to impart their lesson on the reader:\n\n> “Tell your story and tell mine because they are not two stories but one, this is why I asked you over and over about yours. Say your name or say my name or say both, your name is mine and they are the same because high and low we are the same, it doesn’t matter what name you say, yours or mine because we are all children of the Language, we all come from the Language and when we die we return to it…”\n\n This interconnectedness is highlighted by Feliciana’s words that each of our stories are one. *Brujas* taught me most of all that when we speak our story, we are speaking the story of the world.",
      "tags": [
        "review",
        "novel",
        "identity",
        "indigeneity",
        "connection"
      ]
    }
  ]
}