{
  "data": [
    {
      "publish_date": "2021-08-28T00:04:37.392Z",
      "month": "2022-12-28T01:03:42.362Z",
      "title": "Velvet Was the Night",
      "author": {
        "name": "Silvia Moreno-Garcia",
        "website": "https://silviamoreno-garcia.com"
      },
      "image": "/uploads/velvetwasthenight.jpg",
      "description": "If there is a new book by Silvia Moreno-Garcia, I’ll most definitely read it. The latest being *Velvet Was the Night*. A noir set in 1970s Mexico City during a turbulent time of government corruption, fears of communism, and students fighting for a freer world, *Velvet Was the Night* is told through a revolving perspective of two main characters: Maite and Elvis.\n\nMaite is a 30-year-old secretary who lives a solitary life absorbed in romance comics and records. Elvis is a 21-year-old “Hawk,” an underground organization of youth paid by the government to infiltrate student-led groups and disrupt protests. Maite and Elvis are brought together by the disappearance of Maite’s neighbor, Leonora, and the mysterious and dangerous photos she’s carrying that could undermine the Hawks and their leader, El Mago. The reader is taken through a third-eye-view as Maite and Elvis attempt to find Leonora, locate these pictures, and stay alive.\n\nBecause of the time and setting, there’s a few key perspectives that intertwine and collide throughout *Velvet Was the Night*:\n\n* Those who are indifferent to the political climate in some way—as embodied by Maite’s and Elvis’ indifference to the political atmosphere (even though their indifference stems from different sources)\n* Those who choose to be politically active for positive change—as embodied by Rubén and the Asterisks \n* Those who choose to play politics for self-gain—as embodied by the puppeteers El Mago, Anaya and other briefly-mentioned government officials \n\nThe underlying tension between these three political perspectives are the driving force for the book. Each of these characters, regardless of how willful they are, are sucked into the political environment, which is a great extended metaphor for politics. Regardless of the level of activity one chooses, a person can never be truly neutral or even apolitical because the larger political landscape seeps into even the every(wo)man’s life like Maite—which recalls the saying, “Being apolitical is political.” This is something that Rubén frequently reminds Maite as they work together, but it is also something that Maite never quite seems to realize, leading to my biggest criticism of the book.\n\n*Velvet Was the Night* would not pass the [Bechdel Test](https://global.oup.com/us/companion.websites/9780199315468/student/ch7/wed/test/). Maite is so concerned about being attractive, getting old, and being alone. She frequently goes off into reveries of her fantasies fueled by romance comics like *Secret Romance*. Maite’s insecurities may be the most painful to read over and over throughout the book. The comments on Maite’s beauty (or lack of) both by Maite herself and the men in the book sometimes distract from the actual plot. Even though Maite has done so much for herself, Maite’s self-deprecation is a reoccurring focal point of the book. Maite has a steady job, bought herself a car, and lives on her own. Despite her struggles, Maite never seems able to appreciate all she has attained because her life and her looks don’t mirror the romance novels she obsessively follows. In some ways, the romance novel acts as a distraction for both the political tension and lack of familial support and disappointment Maite faces from her mother and sister. However, until the very end of the book, Maite does not seem able to enjoy the life she has created for herself because of this internal narrative, and most likely larger societal pressures faced by Latinas of the time. Like Maite fails to observe the larger political strife, she also fails to observe the large gender norms. The lack of growth the reader fails to see in Maite’s perspective of the world and, most importantly, of herself is perhaps the true tragedy.\n\nOverall, *Velvet Was the Night* is entertaining and provides some insight into a turbulent time of Mexico’s history as well as references to great oldies. The characters embody interesting political perspectives that captures attitudes of the time that could easily be applied to individual political attitudes today. However, if you’re like me, it might be difficult and somewhat triggering to sit with a main character like Maite that thinks so little of herself—especially because she experiences very little growth by end.",
      "tags": [
        "noir",
        "detective",
        "mystery"
      ]
    },
    {
      "publish_date": "2022-08-06T07:00:00.000Z",
      "month": "2023-01-07T03:31:25.777Z",
      "title": "The Many Daughters of Afong Moy",
      "author": {
        "name": "Jamie Ford",
        "website": "https://jamieford.com"
      },
      "image": "/uploads/tmdoam.jpg",
      "description": "I picked up Jamie Ford’s *[The Many Daughters of Afong Moy](https://bookshop.org/p/books/the-many-daughters-of-afong-moy-jamie-ford/17805412?ean=9781982158217)* from a recommendation by [@latinarebels](https://www.instagram.com/latinarebels/?hl=en) on Instagram, and I was not disappointed. *The Many Daughters of Afong Moy* spans almost 250 years and over seven generations of Afong Moy and her family’s lives as they navigate forced immigration, social expectations, violence, identity, and the reconciliation of the trauma they and their ancestors have faced. The overarching exploration of this book brilliantly captures the [transgenerational epigenetic inheritance](https://news.ucsc.edu/2022/09/epigenetic-inheritance.html), the transgenerational trauma that is inevitably passed from one person to another, and the way this trauma lives in the body and shapes who we are. Thankfully, Ford doesn’t just leave us with a depiction of trauma and its inheritance, he also imagines a future where deep healing from transgenerational trauma is possible. \n\n![Afong Moy (1842): Lai King (1892) - Granddaughter Afong Moy, Zoe / Zou Yi (1927) - Daughter of Lai King, Faye / Fei-jin (1942) - Daughter of Zoe, Greta (2014) - Great(?) grandaughter of Faye, Dorothy (2045) - Daughter of Greta, Annabel (2086) - Daughter of Dorothy](/uploads/moyfam.png \"The Family of Afong Moy\")\n\nIn a series of short stories organized nonchronologically, the reader is slowly presented the intertwined stories of Afong, Lai King, Zoe, Faye, Greta, Dorothy, and Annabel. The nonchronological order captures a natural rhythm of storytelling while also depicting the non-linear impact of trauma. As the reader makes their way through each chapter, the sequence of the book emphasizes the “echoes,” as a later chapter is titled, of each woman’s story within another’s. Sometimes these “echoes” are actual visions of another timeline and other “echoes” are similar events, such as Dorothy realizing her daughter is drawing the same exact plane, possibly [a P-40 flown by Americans hired by China during WWII](https://www.npr.org/2021/12/19/1062091832/flying-tigers-americans-china-world-war-ii-history-japan), Dorothy drew as a girl.\n\nThroughout the book, Ford does a brilliant job capturing the painful paradox of those living with the aftereffects of trauma. Often those with past trauma want the trauma to remain buried and forgotten, like Lai King when she thinks about losing her mother, father, and home to the plague, “Lai King’s heart ached for all the things she wished she could forget.” Because our body wants to protect us, the memory of these painful experiences become ingrained in our bodies to help us avoid future pain if possible. The exact opposite of what Lai King, and most of us, want. If one can work through the pain, though, there is also some freedom in learning about our history and the intricate factors that have shaped who we are. In *Afong Moy*, Dorothy’s therapist recommends an experimental trial of epigenetic therapy led by Dr. Shedhorn. Dr. Shedhorn has developed a process that allows patients to identify and explore their transgenerational epigenetic inheritance and the accompanying trauma to address anxiety, depression, PTSD, and other mental illnesses that may be linked to this trauma. When Dorothy’s partner asks how her sessions are going, Dorothy thinks: “…feeling okay after a lifetime of feeling everything—rage, grief, anxiety, sadness, confusion, disconnection, and longing—to just feel okay was as wonderful as it was unfamiliar. She felt intoxicated by normality.” Though the lived and remembered trauma is painful, processing the trauma and finding some sense of “normality” is a blessing. Something those of us who’ve gone through or are currently undergoing therapy can certainly agree with.\n\nOne of the most captivating parts of *Afong Moy* is the constant emphasis of interconnectedness. Here, interconnectedness is not so much rebirth, but a thread of deep connection between generation. A thread that points to death as a shift in existence. At first, Dorothy thinks of this interconnectedness as a dilution of the self, “Dorothy imagined herself as a copy of a copy of a copy. Each version less sharp, less clear, more muddy, blurry around the edges of happiness and contentment.” However, Dr. Shedhorn explains to Dorothy that “each generation is built upon the genetic ruins of the past. That our lives are merely biological waypoints. We’re not individual flowers, annuals that bloom and then die. We’re perennials. A part of us comes back each new season, carrying a bit of the genus of the previous floret.” In this context, the self is a confluence of the individual, our ancestors, and the seemingly infinite events that have led to our existence with almost unbelievable precision. The only part that makes any of this miraculous occurrence believable is the unlikely fact we’re here. Each of us only new in form but ancient in content; always carrying a part of the past.\n\n*The Many Daughters of Afong Moy* underscores the beauty of the interconnectedness within and amongst each other, but it also emphasizes the weight of this responsibility for each new generation. From the time Afong Moy is sent to America by her dead husband’s family in 1842, each of Afong’s relatives had to carry the weight of their past along with their own. Not until over 200 years had passed, during Dorothy’s time in 2045, did any of Afong’s family members have the tools to safely and effectively process the trauma the prior generations experienced to finally break the cycle. And this reality, hoping that our children and our children’s children will have more than us, have better than us, is a bittersweet thread that links these stories together. It brings a deeper understanding to all the pain our ancestors experienced—even those from recent generation—with little to no access to proper care and healing.\n\n*The Many Daughters of Afong Moy* is powerful, successfully navigates a wide breadth of time, and fruitfully portrays complex themes. Lai King says, “‘Ghosts aren’t always bad. Sometimes they’re just our ancestors checking in on us.’” The ghosts of the past surround us, and their echoes reverberate within the microcosm of the self ultimately shaping who we are. If we’re lucky, we might even see a ghost or two, and welcome them.",
      "tags": [
        "novel",
        "trauma",
        "family",
        "time"
      ]
    },
    {
      "publish_date": "2022-08-19T00:17:25.767Z",
      "month": "2023-01-19T01:16:09.784Z",
      "title": "Witches",
      "author": {
        "name": "Brenda Lozano and Heather Cleary"
      },
      "image": "/uploads/witches.jpg",
      "description": "*[Brujas](https://bookshop.org/p/books/brujas-witches-brenda-lozano/14484399?ean=9786073189194)* is the second book I’ve read by Brenda Lozano, who is easily becoming one of my favorite authors. *Brujas,* or its English translation, *[Witches](https://bookshop.org/p/books/witches-brenda-lozano/17837989?ean=9781646220687)*,is a novel about a young journalist, Zoe, who is interviewing a famous curandera, Feliciana, from San Felipe, Oaxaca, Mexico, after Zoe learns about the death of Feliciana’s cousin, Paloma. Throughout the interview with Feliciana, Zoe learns as much about herself as she learns about the journey of Feliciana and Paloma. Feliciana is the first female-born curandera in a long line of curanderos who is taught the ways of the \"Language” by Paloma, also a curandera and a person who identifies as [Muxe](https://nhm.org/stories/beyond-gender-indigenous-perspectives-muxe), the name for the third-gender people of the [Zapotec](https://indigenousmexico.org/oaxaca/the-mixtecs-and-zapotecs-two-enduring-cultures-of-oaxaca/), an indigenous people from Oaxaca, Mexico. *Brujas* does a wonderful job exploring many intricate themes, such as language, self-exploration, inheritance, gender and gender identity, indigeneity, love, colonization, violence, and so many others. Each theme seamlessly integrated into the novel takes the reader on an everchanging exploration of life.\n\n*Brujas* is told through the converging narratives of Feliciana and Zoe. Two women from different upbringings brought together by the death of Paloma. Even though both women’s lives are distinctly different, the juxtaposition of their stories reveals the echo, the connection we have with another that is more similar than different. Throughout the novel, Feliciana and Zoe take turns divulging their life stories. The interchanging narrative structure is explained in part by Zoe, “I came to understand that you can’t really know another woman until you know yourself.” This is Zoe’s introduction to the self-exploration and self-discovery she experiences as the book unfolds. Though Zoe’s story is important, Feliciana’s and Paloma’s stories are the foci of the book.\n\nZoe’s story is told in a traditional linear narrative of her growing up as the eldest daughter with a father who was silent but trustworthy, a mother who couldn’t keep anything to herself, and a sister who couldn’t be anything but herself. Because of her sister’s wildness, Zoe felt the need to choose a life that she thought was expected of her, “In my role as firstborn, I hadn’t allowed myself to do what I wanted—I’d always done what I thought I should do.” Zoe’s realization is revealed with the help of Feliciana and the “Children,” the [hallucinogenic mushrooms](https://www.brown.edu/campus-life/health/services/promotion/alcohol-other-drugs-other-drugs/psilocybin-mushrooms) Feliciana uses to conduct her ceremonies. With the help of the Children, Feliciana unearths and releases the “deep waters,” the inner most self of one’s self, using the power of the “Language” and the “Book,” “On the third night, Feliciana gave me four pairs of mushrooms and guided me with the Language, she read me a page from the Book. This is yours, \\[Feliciana] said, this is your page and these words of the Language are yours, Zoe. This is the page you were missing.” In Feliciana’s ceremonies, she guides individuals like Zoe through the ceremony to help them discover their “deep waters,” which offers the person a chance to heal and find peace from the guilt they carry.\n\nFeliciana’s narrative, however, is markedly distinct. First, Feliciana is being translated from her original Zapotec to Spanish (and then into English if you’re reading the English version, *Witches*). Yet, the writing captures the non-linear, elliptical nature of Feliciana’s oral storytelling which resonates with Feliciana’s description of nature, “…nature has the answers to the ills we suffer, you just have to watch the circles time moves in to understand our nature, the nature of people.” Feliciana’s story folds into itself. It moves forward and backward in a way that creates an echo, a feeling of “Why does this seem so familiar?” Feliciana’s narration builds and builds making sure not to leave the reader/listener behind:\n\n> “…I don’t know when I was born because I was born like the mountain was, go as the mountain when it was born, but I know it was six at night when Guadalupe came to say they killed Paloma as she was getting ready to go out…” (Chapter 1)\n>\n> “I don’t know times, I don’t know dates, I don’t know when I was born so don’t ask me that because I don’t know, but I know that terrible hour…I knew that man had killed her with a dagger in her back from his rage at Paloma for being Muxe…” (Chapter 19)\n\n In Feliciana’s elliptical style, we learn about her journey, but, simultaneously, the journey of Paloma, who doesn’t carry guilt and brings ease to those around her, “People laughed with \\[Paloma] and they went to her because she was good at giving advice about love….” Despite the good that Paloma was able to bring into the world, she’s killed because someone could not see past her identity as Muxe. In this way, the book is centered around prejudice and gender-based violence beginning with Paloma’s murder to Feliciana’s own experiences with domestic violence to Leandra’s, Zoe’s sister, sexual assault. \n\nAnother powerful theme throughout the book is Feliciana’s rejection of colonization and her dedication to preserving her culture, “I speak only my tongue, this tongue that reaches you through an interpreter, this tongue that is the tongue of my ancestors. I will not end my tongue with any other because this tongue is who I am, it is the tongue of my ancestors and this tongue is who I am, I honor who I am when I speak it.” Throughout *Brujas*, it is clear that colonization has stolen and erased so much of what made us whole. The mindset of the colonized people Feliciana encounters causes them to refuse to learn from those who are still so connected to the “deep waters” of tradition and nature like Feliciana. These people come from around the world to learn from her about the Children, “It’s the other way around, the mushrooms take care of you, bring them with you so they can take care of you in Japan for me. And the Japanese men laughed…they didn’t understand what I was telling them.” These powerful people come to learn from Feliciana, who generously shares her rituals, yet they laugh and disregard her generosity and wisdom instead of listen.\n\nWhen someone asked me recently for self-help book recommendations, I realized I don’t read any, and I don’t need to because books like *Brujas* not only teach readers so much about life but provide the reader with the gift of a new perspective in a way that only a book can by building an intimate connection between reader and subject. So intimate, sometimes it’s hard to distinguish who needs who to survive, the reader to bring the subject to life or the subject to impart their lesson on the reader:\n\n> “Tell your story and tell mine because they are not two stories but one, this is why I asked you over and over about yours. Say your name or say my name or say both, your name is mine and they are the same because high and low we are the same, it doesn’t matter what name you say, yours or mine because we are all children of the Language, we all come from the Language and when we die we return to it…”\n\n This interconnectedness is highlighted by Feliciana’s words that each of our stories are one. *Brujas* taught me most of all that when we speak our story, we are speaking the story of the world.",
      "tags": [
        "review",
        "novel",
        "identity",
        "indigeneity",
        "connection"
      ]
    },
    {
      "publish_date": "2020-08-29T07:00:00.000Z",
      "month": "2023-01-30T04:00:40.161Z",
      "title": "Against the Loveless World",
      "author": {
        "name": "Susan Abulhawa"
      },
      "image": "/uploads/against-the-loveless-world.jpeg",
      "description": "[Susan Abulhawa](https://en.wikipedia.org/wiki/Susan_Abulhawa)’s *[Against the Loveless World](https://www.simonandschuster.com/books/Against-the-Loveless-World/Susan-Abulhawa/9781982137045)* is a striking, beautiful, and heartbreaking story, and possibly one of the best books I’ve ever read, about a young Palestinian girl, Nahr, and her family who become displaced from their home in the 1980s. Though Nahr’s story is rife with struggle, her, her family, and all of the displaced Palestinian community’s ultimate revolutionary act is to choose to find happiness and joy in small ways despite the “loveless world’s” ceaseless attempt to take everything from them. \n\nThe story begins with Nahr in “the cube,” a prison cell. Each chapter begins with a description of a section of the cube, Nahr’s whole world when the reader is introduced to her. After this initial introduction, the reader is quickly moved into Nahr’s past as a young girl in Kuwait. Nahr is a Kuwaiti-born Palestinian, one of the many who never even knew her home land. Yet, knowing full well that Kuwait and the surrounding world at best tolerate her people and at worst work to actively extinguish them through poverty, bombings, or military control. In Kuwait, it’s poverty. At 19, Nahr marries a man named Mhammad—the brother of a famous Palestinian revolutionary, Bilal. Nahr’s friends were drawn to him, but Mhammad chose her. They quickly married for a short time until Mhammad leaves Nahr, and she eventually has to return to her mother’s home with the shadow of being unable to keep a husband. \n\nOne day at a wedding, Nahr’s famous captivating dancing catches the eye of Um Buraq, a woman that will change Nahr’s life forever by providing her with money but also the path of “corruption.” Um Buraq circles Nahr’s life after their first meeting until one day Nahr gives in. Meeting Um Buraq at her home, she finds a few other young women already dressed in tight fitting clothes and heels. Um Buraq gives a similar outfit to Nahr, and Nahr loves the way her body looks in her red dress. After trying whisky for the first time, Nahr, Um Buraq, and the two other women join a few rich men for an evening. Nahr dances and enjoys the freedom that is so different from her normal life. Until one of the younger men isolates her outside, sexually assaulting her. During the violence, Nahr is deeply cut by a piece of glass in the sand where they lay. Nahr wants nothing to do with Um Buraq after she heals. She just wants to be normal, return to the life she had before Mhammad. But, Um Buraq pays her the same amount of money for one evening than Nahr would make in a whole month. So, Nahr is inevitably pulled into this life that pays well, gives her some freedoms, allows her to support her family, and send her brother to the university at the cost of her self. This money also helps her free her brother after he’s wrongfully imprisoned and Um Buraq eventually helps her escape Kuwait for Amman, Jordan when Kuwait is no longer safe for Palestinians during Saddam Hussein’s rule and the Gulf War, “But I know now that going from place to place is just something exiles have to do. Whatever the reason, the earth is never steady beneath our feet,” rationalizes Nahr. \n\nIn Amman, Nahr is free from her life in Kuwait, “I have to become another person, someone at the other end of disgrace, rape and exile,” but she doesn’t have a way to make money and lead the household any longer, so her mother and brother take on this load while Nahr sinks into a depression until she focuses on her doing hair, nails, and facials. Eventually, Nahr’s brother convinces her to finally get a divorce from Mhammad so she can move on. With her Palestinian visa, she visits her homeland and meets Mhammad’s family for the first time while staying with them through the divorce. While there, she gets close to Bilal, Mhammad’s brother and a famous Palestinian hero, and learns about and becomes involved in the Palestinian revolution. After her time in Palestine, Nahr ends up marrying Bilal, “As our kiss deepened, became more expressive, thirstier, I was overcome by a desire to weep. No one had ever kissed me with such love, and it occurred to me that happiness can reach such depths that it becomes something akin to grief.” They spent the few months of their marriage under heavy curfew until Bilal and a few other Palestinian fighters orchestrate small attacks against the Israelis. Causing Nahr to be caught, sentenced for terrorism, and imprisoned in The Cube for 16 years. \n\nWhen Nahr is finally released, she’s in her 40s and returns to her mother and brother in Amman because Bilal had been thought dead or hiding for those 16 years. Nahr’s grandmother had long died. Um Buraq was dying. Like in those years before, Um Buraq was the only one who could save Nahr, and she did. Bringing Nahr back to the world that she was released in, “Bitterness is hard to keep away. Um Buraq sighs, flashing the gap in her teeth. ‘It sure is a beautiful world, though,’ she says, surveying the grandeur of our planet, knowing her days are few.” And, this is the overwhelming beauty of Abulhawa’s book: Perhaps the greatest revolutionary acts are to keep fighting, keep loving, keep finding beauty in the lovingly loveless world.",
      "tags": [
        "review",
        "exile",
        "war",
        "overcoming",
        "strength"
      ]
    },
    {
      "publish_date": "2022-12-08T08:00:00.000Z",
      "month": "2023-02-09T03:22:01.414Z",
      "title": "Scatterlings",
      "author": {
        "name": "Rešoketšwe Manenzhe"
      },
      "image": "/uploads/scatterlings.jpg",
      "description": "During my last round of book selection, I scoured through lists upon lists of recommended books until I thankfully came across Rešoketšwe Manenzhe’s novel, *[Scatterlings](https://www.harpercollins.com/products/scatterlings-resoketswe-martha-manenzhe?variant=39933624418338)*. *Scatterlings* follows the arduous journey of a multiracial family, the van Zijls, during the passing of the 1927 [Immorality Act](https://en.wikipedia.org/wiki/Immorality_Act), a law that prohibited relationships between a white person and people of other races, in South Africa. As the main characters Abram and Alisa van Zijl navigate their crumbling but technically legal marriage, they both learn the government is going to find ways to make their partnership illegal and use their children, Dido and Emilia, as evidence of breaking the new law. Weaved through the novel are so many complex themes—such as the evils of slavery, the destructive effects of colonization, the loss and long-term trauma that impacted hundreds of thousands of people because of colonization and slavery, the challenges of being a liminal identity (adopted, multiracial, interracial relationships), the importance of being connected to one’s ancestors, and so many others—taking the reader on a journey in search of one’s ancestors and finding one’s true home.\n\nDuring the passing of The Immorality Act, Alisa immediately feels the rightful fear of what this means for both her and her family. Alisa knows that once one freedom is taken, there’s nothing to stop the government from taking more. Abram, however, blinded by privilege and the corresponding hope (and safety) of his whiteness thinks Alisa is exaggerating until an officer from the House of Assembly comes to “survey” their home: “As simply as that, the wool of foolishness was clawed from Abram’s eyes. Ah, how quickly it all happened. By the time the sun set and rose again, all his hope was gone.” Because of Alisa’s struggle with her mental health paired with an increasing sense of doom brought on by the passing of the Immorality Act, she decides she can no longer continue living and decides to do the unthinkable: Take the lives of her and her daughters. Reaching this heartbreaking rationale, Alisa decides she must keep her daughters from facing the same punishments of their skin Alisa has experienced, “I couldn’t spare my daughters the burden of my skin, but I must spare them *this*—this thing I must do. I can’t leave them behind. They would be shunned. One tragedy they could survive, but not both at the same time.” This terrible conclusion ends in the death of Alisa and her youngest daughter, Emilia. Her eldest daughter, Dido, barely pulled from the reaches of the fire by Abram. \n\nIt is painfully clear the constant onslaught Alisa has faced her entire life has contributed to her struggle with depression, “I don’t want to be this way: curled in my bed and crying over an emptiness I don’t understand. I want what my moth wants for me: a smile, a clear head, lightheartedness, freedom from these chains I can’t even tough or feel or smell, these chains that exist only in my mind.” Alisa’s seemingly inherent mental struggles might also be attributed to [transgenerational epigenetic trauma](https://www.nature.com/articles/s41576-021-00438-5) (a topic Jamie Ford eloquently tackles in *[The Many Daughters of Afong Moy](https://www.allysonjeffredo.com/the-bookest/the-many-daughters-of-afong-moy)).* Some 65 years from when the reader encounters Alisa in time, we know so much more about mental illness and have been delving deeper into the complexities of transgenerational epigenetic trauma. Now, equipped to understand the likelihood Alisa is carrying the trauma of slavery as the daughter of enslaved people*.*\n\nThe darkness that follows Alisa manifests as a deep yearning for Africa: “More and more, I know I must go to Africa. I think that’s the best chance I have of understanding whatever it is that’s ailing me…Something not quite of this world has been calling me there. I need to go.” This “something” could easily be traced to the calls of her ancestors, a forgotten people of West Africa. A people decimated by colonization and the slave trade. \n\nPart of Alisa’s yearning for home is her desire for connection to her ancestors that was refused her and her family. But, through her passing, she created the precise circumstances for her family to be connected back to their people. Mmakoma, Dido and Emilia’s nanny, felt called to give Alisa and Emilia a traditional burial and connect Dido with their ancestors. During the ceremony Mmakoma leads to re-connect Dido with her ancestors, Dido finds immediate connection: \n\n“The song carried her name through the wind, through time and time and all the echoes of the people that bound her where she stood. That call lulled her. It wove her into its endless ribbons of foreign faces and strange names and shadow memories. It pulled her gently, and them strongly into the pot, where the faces and names and memories told her stories that sheltered her soul.”\n\nAnd, though the story of Alisa is marred by tragedy, there are beautiful moments of hope like this or when we’re introduced to Alisa’s old journal entries and catch young Alisa less burdened. Alisa was called back to Africa. She unfortunately was unable to connect to the place of her ancestors as she had sought, but Dido was able to complete Alisa’s journey while beginning her own. \n\nThe last chapter of *Scatterlings* ends in this incredible depiction of how Dido is reconnected to her ancestors with the help of the wind of singing voices, “A call echoes from her. It was a child-voice. It begged for refuge from a nameless people somewhere in the world…Being the wind of singing voices, it was compelled to catch the child-voice…The wind the carried the echo this way and that…” Not only has the institutions of colonization and slavery ripped people from one another and their land, it becomes clear these systems have ruptured a whole people so completely even the ancestors are scattered, “The ears \\[the wind] sought were scattered. They were in this place and that, beneath this earth and that, beholden to these people and those who came from over there, to every place and nowhere at all, to every god and none, to nothing, to everything.” This scattering of people, *scatterlings*, recalls the title and Alisa’s yearning for Africa, for the home of her ancestors, but even they are scattered. Thank goodness for the persistence of the wind of singing voices who chooses to search even the “The Gate of No Return” where “\\[t]he wind slipped through…and whirled to call forth the ancient people of that place” finally “\\[t]he child-voice was home at last,” which leads the ancestors to both the souls of Alisa and Emilia bringing them home with them and simultaneously setting them free.\n\nIn an incredible book dense with so much rich commentary on colonization, slavery, identity, ancestry, spiritualism, and others, *Scatterlings* takes the reader on a family’s journey for reconnection to their people that allows them the freedom to live in the present despite attacks the same oppressive institutions only guised under a different name. It is a book that speaks to the amazing perseverance of Alisa who courageously follows her heart back to Africa to find home, and, even more amazingly, finds it even when all hope was lost.",
      "tags": [
        "review",
        "novel",
        "searching",
        "ancestors",
        "hope"
      ]
    },
    {
      "publish_date": "2022-12-27T08:00:00.000Z",
      "month": "2023-02-28T04:57:36.326Z",
      "title": "Roses, in the Mouth of a Lion",
      "author": {
        "name": "Bushra Rehman",
        "website": "https://www.bushrarehman.com"
      },
      "image": "/uploads/ritmoal.jpg",
      "description": "I first read [Bushra Rehman](https://www.bushrarehman.com/)’s “Ajax, Raid, Mr. Clean” in *The Blueshift Journal* (unfortunately no longer available online) and fell immediately in love. I loved the way the story so accurately captures life with roaches. I love the way the story took the time to write about roaches at all. I read it at a time where I needed reminding that all of our stories are worth telling—even those that feel shameful. When I picked up *[Roses, in the Mouth of a Lion](https://bookshop.org/p/books/roses-in-the-mouth-of-a-lion-bushra-rehman/17868145)*, it was a pleasant surprise to find this story in the novel, and I quickly learned that *Roses* as a whole was going to be full of Rehman’s unique and beautiful constructed depictions of life like I first experienced in “Ajax, Raid, Mr. Clean” years ago. \n\n*Roses* is a novel about connection and disconnection between a young Pakistani American woman, Razia, her family, and her community as Razia grows up and discovers who she is. The novel meditates on themes of assimilation, discrimination, sexual harassment, women’s constant fear, identity, religiosity, and so much more. Each chapter functions on its own, but, when read together, they build a home, a life in Corona, Queens, New York where Razia and her family navigate life in the United States as first- and second-generation Pakistani Americans. Rehman does an incredibly effective job using the short-story-as-chapter format to cover vast thematic territory. From the AIDS epidemic to post-partum depression to self-discovery, Rehman covers so much ground in this queer coming-of-age novel that confronts many difficult themes head on. \n\nThe thematic line that is at the heart of the novel is the building tension of Razia trying to be the perfect daughter for a mother, family, and religion that refuses to accept who she really is. Razia loves her mother, her family, her religion, her rituals, which can be attributed to our yearning desire for love, “I realized we were all like the ducks. We would do anything, even go against our natural instincts, so we could be taken care of.” However, Razia also wants to escape the confines of everything that she loves that doesn’t want to understand her. It’s so relatable. Children are in some ways cursed to have such a deep understanding of their families when often, as is the case with Razia, a deep understanding of their children eludes many parents. Instead, parents see who their children *should* be. After Razia experiences a failed attempt of cutting her hair, her mother, “said slowly, so each word could be stamped on me: ‘You look ridiculous. Like a crazy person. A crazy person is someone who thinks they’re something they’re not.’ She flipped the roti on the tava and pressed down on it with a cloth.” There are so many points of tension here, but one that cycles throughout the book is: Razia’s mother cannot accept that Razia is a young American teenager. This point is further developed when Razia’s mother discovers Razia’s thrift store clothes buried in the back of her closest. Instead of trying to understand Razia and the importance of creating one’s identity, Razia’s mother throws her clothes away creating a deeper chasm between Razia and her mother. After the incident, Razia has a poignant conversation with her father: \n\n> “It’s just clothes,\" I managed to say. \n>\n> He sighed. \"It’s not just clothes. No matter what you do, if you try to be American, they will never accept you. They’ll turn against you in the end.\"\n>\n> How could I explain that I wasn’t trying to be American, I already was?\n\nThough it’s never explicitly said, parents fear raising children that are completely unknown to them—especially immigrant parents who are in a whole new world. A new world that does everything it can to keep them out. Unfortunately, a parent can only minimize the influence of place for so long. Razia is an American, and there is a tension within her family that can’t come to terms with this portion of Razia’s identity. They want to hang onto the old ways, when the identity Razia is creating for herself is learning how to weave the old ways with the new ways all on her own—an immensely admirable feat. \n\nOne of the most painful offshoots of this thematic line is the way Razia’s mother finds empathy for others but cannot find this empathy for Razia, which is made apparent later in the book when Razia’s family takes in Shahnaaz:\n\n> “…Shahnaaz began to follow my mother around. I’d walk in on them, their heads bent together, reading the Bahishti Zewar. They’d watch Days of Our Lives, gossiping about the characters as if they were people we knew from Corona. My mother began to teach her how to cook. She’d never even let me into the kitchen. She always said my schoolwork was too important.” \n\nRazia tries so hard to appease her mother. Razia is devout, respectful, intelligent, but, for some reason, her mother cannot find it in her to show Razia the same type of empathy and understanding that she can conjure for even a rebel like Shahnaaz. This tension coalesces into the climactic moment when Razia’s parents learn about her relationship with Angela, a girl from the fancy school, Stuyvesant, she worked so hard to attend:\n\n> “He held up my diary. ‘Razia. What is this?’ His hands shook. I thought of everything I’d written about Angela and felt my insides shriveling. He flipped through the pages and stopped at one. His face turned red. ‘What you write about this girl. In Pakistan, they’d kill you. For this you’ll burn in Hell.’\n>\n> I was used to my mother saying I’d burn in Hell, but coming from my father, the words shook me.”\n\nThis moment is incredibly hard to read. Throughout the novel, I was rooting for Razia to find the peace and connection with her mother she has always yearned for, “I had a sudden irrational desire to hug her, but there was so much distance between us.” But, this moment shows that no matter how much right one does, it can all be undone in a second. Razia is acutely aware of the fact that she won’t be able to connect with her mother, “My birth had been only the beginning of our separation, the first time I was cut loose. From that moment until now, I’d just been going farther and farther away, my body a lifeboat pushing into the ocean.” Throughout the book up until the tumultuous point of tension when her parents discover Razia’s relationship with Angela, Razia is conscious of the growing disconnection between her and her mother and frequently alludes to running away almost as if she always knew there was no other way out for her.  \n\n*Roses, in the Mouth of a Lion* expertly tackles so many complex themes without holding back like books with young protagonists often do. By the end, I wanted more. At the end of great books, I often feel a sense of loss. With *Roses,* I felt a flood of grief for Razia, for the fact the book had ended, and because I unfortunately won’t know whether Razia wins in the end. I only have my hope that she’ll pull through in what has become one of my favorite coming-of-age novels.",
      "tags": [
        "review",
        "coming-of-age",
        "novel"
      ]
    }
  ]
}