{
  "data": [
    {
      "publish_date": "",
      "month": "April 9, 2020 7:27 PM",
      "title": "On Earth We're Briefly Gorgeous",
      "author": {
        "name": "Ocean Vuong",
        "website": "https://www.oceanvuong.com"
      },
      "description": "Book of the Month for April 2020: Ocean Vuong's *On Earth We're Briefly Gorgeous: A Novel*. This novel is a letter from a son to his mother that explores the complicated truths of their love. Our first book discussion will be on Monday, April 13th at 7:00 pm, but we can talk all month long using Zoom. Send an email to [hello@allysonjeffredo.com ](mailto:hello@allysonjeffredo.com) with an introduction to be added to the group!",
      "image": "uploads/oewbg_vuong.jpg",
      "tags": [
        "fiction"
      ]
    },
    {
      "publish_date": "",
      "month": "2020-05-14T23:03:31.607Z",
      "title": "There There: A Novel",
      "author": {
        "name": "Tommy Orange",
        "twitter_handle": "@thommyorange"
      },
      "image": "uploads/orange_tt.jpg",
      "description": "Book of the Month for May 2020: Tommy Orange's *There There: A Novel.* Based in Oakland, California, Orange's debut novel follows the lives of 12 interconnected characters as they travel to the Big Oakland Powwow, where all the stories converge in a fascinating and heartbreaking event. Our book discussion will take place on Monday, May 18th at 7:00 pm. Send an email to [hello@allysonjeffredo.com](mailto:hello@allysonjeffredo.com) with an introduction to be invited to attended!\n\n\n\n#### Book Club Questions\n\nICEBREAKER: Blue is show a moment of kindness in the Greyhound bathroom as she tries to escape her abusive husband Paul by returning to Oakland. When Paul tries to enter the bathroom, an older woman reminds him that it's the women's bathroom, which keeps him from entering. She then decides to wait with Blue and walk her to her bus to make sure she makes it safely there (206-207). Describe a moment you were shown kindness just-in-time.\n\nBoth the prologue and interlude offer moments of historical context. What do you think of these two sections? Who is speaking here? Do they change the audience of the *There, There*?\n\nWhat do you make of Tony Loneman's storyline bookending *There, There*? What is important/significant about his character? Can you see anyone else's storyline in this position?\n\nWhat does the variety of intersecting characters and storylines offer *There, There* that a single narrative thread couldn't? Are there any downsides of this point of view?\n\nTony Loneman says about drunk Octavio, \"He told me he never meant to become what he'd become, and I wasn't sure what that was, a drunk, or a drug dealer, or both, or something else\" (22). To what extent do you believe Octavio is victim of Chimamandi Ngozi Adiche's idea of the \"single story\" or a limitation in acceptable stories.\n\nThroughout *There, There* there are substories that remind the reader of the destruction of Native lives and culture throughout American history, such as Lucas' documentary (31), the conversation between Opal and Two Shoes (51), and Edwin's short story (244-245). What do effect do these substories have on the story itself and on the reader?\n\nOne major theme that is throughout the text is on Native identity and feeling Native enough, which speaks to the confusing nature of the liminal identity, since a few of the characters are racial mixed or have were not brought up with cultural knowledges and practices. Blue finds \"medicine\" for this in-betweenness in the ceremony she experiences in Oklahoma with Paul's father. What is you \"medicine\" for the liminal state, when you don't feel like one of your identities is \"enough\"?\n\nAnother thematic thread in *There, There* is that of forgiveness and the weight of having to choose to hang onto to or let go the hurt/pain caused by history, addition, abuse...etc. We especially see this struggle with Jacquie Red Feather's struggle with her relationship with Harvey when he says, \"I get that shame too. The kind that's made of more years than you know you have left to live. That shame that makes you wanna say fuck it and just go back to drinking as a means to an end...\" (112-113). What do you think *There, There* is asking it's reader to do with their knowledge of history and the pain and devestation it has left?",
      "tags": [
        "Fiction"
      ]
    },
    {
      "publish_date": "",
      "month": "2020-06-24T21:25:05.855Z",
      "title": "The Body is Not an Apology: The Power of Radical Self-Love",
      "author": {
        "name": "Sonya Renee Taylor",
        "website": "https://thebodyisnotanapology.com"
      },
      "image": "/uploads/taylor.jpg",
      "description": "Book of the Month for June 2020: Sonya Renee Taylor's powerful self-love text *The Body is Not an Apology: The Power of Radical Self-Love*. Taylor's text offers guidance on how one can begin the process of radical self-love when faced with a society that actively advocates for self-shame with intrusive narratives about body, sexuality, gender and others. This narratives frequently setup an unattainable ideal leaving many feeling \"not normal\" or \"not good enough.\" Our book discussion will be on Monday, June 15th at 7:00 pm via Zoom. Send an email to [hello@allysonjeffredo.com](mailto:hello@allysonjeffredo.com) with an introduction to be added to the group!",
      "tags": [
        "non-fiction",
        "self-love"
      ]
    },
    {
      "publish_date": "",
      "month": "2020-07-23T17:36:30.289Z",
      "title": "How to Be an Antiracist",
      "author": {
        "name": "Ibram X. Kendi",
        "website": "https://www.ibramxkendi.com/how-to-be-an-antiracist-1"
      },
      "image": "/uploads/kendi_htbaa.jpg",
      "description": "Book of the Month for July 2020: Ibram X. Kendi's bestseller, *How to be an Antiracist.* This text explores the importance of moving beyond the passive stance of being \"not racist\" to proactively become an \"antiracist.\" Our book discussion will take place on Monday, July 20th at 7:00 pm via Zoom. Send an email to [hello@allysonjeffredo.com](mailto:hello@allysonjeffredo.com) with an introduction to be added to the group!",
      "tags": [
        "nonfiction",
        "racism"
      ]
    }
  ]
}