{
  "data": [
    {
      "title": "We Must First Find the Stories",
      "publish_date": "2018-04-28T17:20:15.965Z",
      "image": "/uploads/aaron-burden-2bg1jPty490-unsplash.jpg",
      "description": "Writing is a revolving practice of patience and forgiveness.",
      "body": "\r\n\r\nFor the past few years, I’ve been trying to be a “working writer.” However, it hasn’t been going so well. I’ve barely written, let alone submitted. I have journals full of poems and essays and half-formed ideas, but, when I try to write them down, I’m struck with a sense of utter revulsion—everything sucks.\r\n\r\nLately, I’ve been trying to edit my M.F.A. manuscript I cobbled together into a conglomerated whole. As before, I got maybe 12 poems in before I felt repulsed by this work. I was wrought with a sense of such frustration—a state I’ve managed to guide myself away from for some time. These poems also brought me to a place of total self-hate—until these poems, another pit I’ve been able to avoid.\r\n\r\nMy frustration and hopelessness grew when I couldn’t figure out why I would even feel this way. Then, it struck me—in the shower, where all good thoughts happen. First, these poems remind me of one of the deepest depressions I’ve experienced since the death of my dad, which hurts to read. I was in a relationship that was awful and stunting, and, inevitably, stunted every part of who I was. But, how did I let myself get so bad? Since that time, I’ve been consumed by the goal to never feel this way again, especially since I’ve recently pulled out of another bout of depression. To complicate things though, I can’t help but feel I need to let myself feel this, and I’m just not ready for it.\r\n\r\nSecond, reading these poems reveal, like letting the faucet turn hot, I’ve been writing with my head instead of my heart. As cliché as it sounds, it’s the truth—clichés are clichés for a reason after all. This revelation hurts. My younger self didn’t know what my heart wanted to say. My current self still doesn’t. I can’t hear my story. I try to listen to my heart beat and write to the rhythm, but I have no words to express this autonomously beating muscle. I feel emotionally locked. Even my vulnerability isn’t deep enough, which is obvious with the collage-like feel of the overall manuscript.\r\n\r\nSo, as I finger this post (we don’t pen anymore…), I want to write myself into existence. I want to find my story or let my story find me. Either way, it’s taking patience and forgiveness. Writing, living is a hike. The elevation changes and so does our pace. Unlike my hikes, however, I still don’t know where to begin, and I’m learning how to let go.\r\n"
    },
    {
      "title": "The Modern-Day Epidemic: Loneliness",
      "publish_date": "2018-05-08T16:55:32.856Z",
      "image": "/uploads/hellomynameis.jpg",
      "description": "",
      "body": "\r\n\r\nBouts of loneliness are inevitable, and I often feel [lonely](https://youtu.be/6EEW-9NDM5k). In the midst of this mindset, I feel like the only person who has ever felt alone. Yet, as solitary as this struggle with loneliness can feel, we all feel it. NPR ran a story on this, “[Americans are a Lonely Lot, and Young People Bear the Heaviest Burden.](https://www.npr.org/sections/health-shots/2018/05/01/606588504/americans-are-a-lonely-lot-and-young-people-bear-the-heaviest-burden)” While listening to this segment stuck in late night traffic, I realized I rarely feel lonelier than sitting in the car by myself reflecting on my loneliness. To exaggerate this feeling, there are some pretty outstanding numbers from a UCLA study on loneliness in this article. The first being:\r\n\r\n-   54% of 20,000 surveyed, “always or sometimes felt that no one know them well.”\r\n\r\nThis means that 10,800 people surveyed feel misunderstood. By using the phrase “no one,” we can assume that people feel misunderstood by even those close to them. What’s interesting, though, is we can feel misunderstood whether we actually are or not. I was having a conversation about pedagogy with a friend who practices a seemingly opposing style—I lean toward structure, she leans away. After I was done explaining my view, she said accusingly, “You need to let go. You’re obviously frustrated with this, and you’re exercising too much control.” I was surprised by this since I wasn’t frustrated at all. I was also surprised because I think there’s a big difference between “structure” and “control”—setting expectations help us find common ground in relationships, especially in classrooms.\r\n\r\nUnlike my family, who always misunderstand me. I hadn’t been this misunderstood from someone outside my family in a while. My family frequently thinks I’m mad when I’m not; they think I’m going to get mad when I won’t. In my family, most paths lead to anger even though I rarely am. But, I don’t feel misunderstood like this by my peers often. Usually, though, I don’t need a moment of legitimate misunderstanding, like the conversation with my friend above, to feel misunderstood. I’m definitely someone who falls in this percentage closer to “always” than “sometimes.”\r\n\r\nThe next statistic is one I don’t necessarily identify with:\r\n\r\n-   56% of those 20,000 either “always or sometimes” felt those around them were “’not necessarily with them.’”\r\n\r\nThis statistic means that 11,600 people in this group believe the people they’re with aren’t present, which may point to phone usage and another article by Business Insider, “[This is Why Our Phones are Making Us Miserable: Happiness Isn’t the Same Thing as Pleasure, and Our Brains Know It.](http://www.businessinsider.com/why-our-phones-are-making-us-miserable-pleasure-isnt-happiness-2018-3)” Our phones make us feel good momentarily without any long-lasting effects, and our brains do not confuse short-term pleasure for long-term happiness, which keeps us in a state of dissatisfaction. With the constancy of social media, it’s hard to pull away from it—even if we want to—because these “pleasure and reward stressors” end up mirroring addiction. So, unfortunately, the ways to feel distant from someone sitting right next to us are innumerable.\r\n\r\nThe last statistic crushed me:\r\n\r\n-   Every 2 in 5 studied experienced the following emotions either “sometimes or always”:\r\n    -   “’they lack companionship’”\r\n    -   “their ‘relationships aren’t meaningful’”\r\n    -   “they ‘are isolated from others’”\r\n\r\nRoughly 8,000 people from the study experienced all or a combination of these three bullet points “sometimes or always.” As a “sometimes or always” feeler of these emotions, I’m heartbroken so many others feel these, too. Knowing that young people are impacted with this more than other age groups means this needs our utmost attention. What is our society to do when these numbers grow? At this point, there is a lot of talk, but not a lot of substantial means, to reduce these numbers. So, with the growing adoption of technology in our lives, we can assume these numbers will increase as more and more generations grow up immersed in technology. Then, how can we save our lonely young people from growing up into lonely adults?\r\n\r\nWe need to invest in mental health by making mindfulness and other mental health strategies a mandatory objective in both health and fitness classes in schools. If we prepared our children to handle the onslaught of emotions we experience growing up instead of leaving them to wade through their emotions alone, many would be less at-risk of feeling like they're drowning. When I was younger, I never remember anyone ever talking about sadness or hurt or anger. I saw these emotions raging through my family, but no one ever addressed them. We just had to deal with it. Even after my dad died, my mom and brother and I would hide our sadness from one another because we didn’t know how to handle it. Inevitably, there was no way we could support one another in any real way, which exacerbated my loneliness, and, probably, theirs too.\r\n\r\nWays to combat loneliness feels like an endless search, so I am constantly looking for healthy and healthier coping mechanisms. For this, I’m thankful for the mental health techniques I’ve learned throughout the years, like hiking and reshaping negative thoughts into positive ones. I’m also thankful for my dog. She keeps me company and forces me to go outside multiple times a day. And, most importantly, she always reminds me someone loves me and needs me, which is often exactly what I need.\r\n"
    },
    {
      "title": "Missing: A Story, A Question, A Riddle",
      "publish_date": "2018-05-12T04:26:43.925Z",
      "image": "/uploads/questionmark.jpg",
      "description": "",
      "body": "\r\n\r\nDuring last year’s Dia de las Madres, a young woman, [Audrey Moran, and her boyfriend, Jonathan Reynoso, disappeared from my hometown, The Coachella Valley](https://www.desertsun.com/story/news/crime_courts/2018/05/09/missing-couple-disappeared-exactly-one-year-ago/586719002/). They went missing. There's no use for the perfect present for _disappear_—one cannot be _disappearing_. That’s reserved for magicians and cats. There’s only _missing_. One can exist in a continuous state of _missing_, but usually in the simple past when they've _disappeared_. So, Audrey _disappeared_ Wednesday, May 10, 2017, but she remains _missing_. Continuously. Either forever or ceasing. I think about her frequently.\r\n\r\n> (how can a body so solid make us believe\r\n>\r\n> in magic, spontaneous combustion & time\r\n>\r\n> machines in the same sentence)\r\n>\r\n> what might your hair have been caught upon—long\r\n>\r\n> strands flowing to the ground\r\n>\r\n> caught in door jambs, under the nails\r\n>\r\n> of hands we see when we look\r\n>\r\n> at our brothers or partners\r\n>\r\n> what might your hands have found\r\n>\r\n> that the wind kept for herself\r\n>\r\n> locked in mountainsides\r\n>\r\n> and the dark sides of bridges\r\n>\r\n> what might your feet have felt\r\n>\r\n> to be weightless or so heavy\r\n>\r\n> they couldn’t bend all those small\r\n>\r\n> bones into position\r\n>\r\n> what might your voice have formed,\r\n>\r\n> your mother, la virgen, some strong\r\n>\r\n> breath of innocence before reality\r\n>\r\n> took the exhale away like a dream\r\n\r\nAudrey and I went to middle school together, but she hung out in the “popular” quad. My best friend would hate on her, the curse of being pretty and cool--which meant these kids wore bright white Nikes and rubberbands to bunch their pants at the ankle. Things we never shared when, later, I ended up doing her hair. She had long, naturally dark hair, so I enjoyed reshaping the layers and taking inches off the ends to make it bounce back to life.\r\n\r\nI did her family’s hair, too. Her tía, her sister, and maybe even her mom. This intimacy of touching, conversing and knowing one’s family might be what has struck me so about her disappearance. This use of _disappearance,_ a noun, as if it's a thing she owns, something she possesses. Where is she? And why does this state of displacement belong to her? An investigating sargeant, Sgt. Walt Mendez, \"believes their disappearance to be involuntary.\" Yet, even in this structure, _disappearance_, whether voluntary or involuntary, still belongs to Audrey and Jonathan. If I’ve been contemplating these questions over the past year, I can’t imagine what questions her family still worry.\r\n\r\nIn our technologically dependent world, even Audrey's device couldn't keep her safe--this is an assumption since we don't know for certain she's not. So, I think I mean: Even Audrey's device couldn't keep _us_ safe from the empty spaces of uncertainty. As far as we know, Audrey’s phone didn’t give away any clues. First, investigators speculated she went to pick up her boyfriend somewhere in Brawley, Ca.—roughly 70 miles south from her home in Indio, Ca. Then, at some point, her car was abandoned off Oak Valley Parkway in Beaumont, Ca., which is about 50 miles west from Indio. Yet, her phone records show she didn’t make/receive any calls from cell towers outside of Indio the evening of her _disappearance_, and it looks like she never left Indio. It's difficult to imagine over the span of 120 miles or less someone wouldn't use their phone to listen to music, write/answer a text or call their mom.\r\n\r\nWithin the last few years, I've read news articles describing how the [police have obtained data location and other logged information from cellphone companies without warrants](https://www.aclu.org/blog/privacy-technology/location-tracking/supreme-court-will-decide-whether-police-need-warrant). People have even been convicted of crimes based on evidence collected from these collections—see Timothy Carpenter’s case that led to _Carpenter v. United States_. With these types of situations and at the rate we check our phones, “[once every 12 minutes](https://nypost.com/2017/11/08/americans-check-their-phones-80-times-a-day-study/)” on average, why don’t we know where Audrey is?\r\n\r\nEven with the continuity of Audrey's _missing,_ it’s hard to imagine someone could go missing without a trace today. I remember being captivated by the show _Unsolved Mysteries_ on Lifetime--I don't remember when it originally aired on NBC and, later, CBS. The mysteries still remind me both of catholicism and my grandma. It is the kind of show that gives parents ammunition to hold onto their kids. No matter how serious the tone, I never saw it as more than a show.\r\n\r\nLiving alone, my mom was really worried about me after Audrey went missing. Even with the proximity, I didn't feel concern for myself at the time. As the time passes, I can feel the fatalistic attitude of the women who raised me becoming more and more apparent. Especially when I start reading numbers, [3,125 adults went mysteriously missing last year in California alone](https://oag.ca.gov/sites/all/files/agweb/pdfs/missing/adults/2017-5-adult-annual-reports.pdf), and 38,985 have gone missing under other circumstances. About 34% are located by police and the known status of other reports increase this number. Yet, [the status of 3,067 of these missing individuals is not accounted for in these numbers](< https://oag.ca.gov/sites/all/files/agweb/pdfs/missing/adults/2017-6-adult-reports-status.pdf>). What's happened to these people? What's happened to Audrey?\r\n\r\nI’m not sure if Audrey is a part of the categorized 39,043 or if she’s a part of the 3,067 that is unaccounted for. Despite the fatalism that's been growing inside me, I’m hopeful they’ll find her. And, there is something inherently hopeful, even without the original use, in this simple future, _they will_ find her.\r\n\r\n> (there is absorption and evaporation,\r\n>\r\n> and neither’s a choice)\r\n>\r\n> too many bodies have found doors i\r\n>\r\n> couldn’t\r\n>\r\n> and i wish for these doors to be a choice\r\n>\r\n> versus\r\n>\r\n> a virus unintentionally put in their mouth\r\n>\r\n> because,\r\n>\r\n> like me, they have the bad habit of chewing their\r\n>\r\n> cuticles\r\n>\r\n> when anxious. sometimes i stand in places and\r\n>\r\n> try\r\n>\r\n> to locate the memory that place must have\r\n>\r\n> inscribed\r\n>\r\n> within the atoms that marks its space, asphalt,\r\n>\r\n> hillside\r\n>\r\n> door jamb or cross. something witnessed the\r\n>\r\n> missing,\r\n>\r\n> but have neither words nor sound.\r\n"
    },
    {
      "title": "An Homage to My Hands",
      "publish_date": "2018-05-21T23:06:43.105Z",
      "image": "/uploads/hand2.jpg",
      "description": "",
      "body": "\r\n\r\nMy life is dependent on the functionality of my hands, yet I take my hands for granted daily. I use them to hold onto my pulling husky, to craft poems, to massage my partner’s shoulders, to pick up my niece, to doodle, to take notes, to grate cheese, to grade essays, to wash my body, to dress myself. It’s incredible how the small hand muscles can grasp and release and pull and push to help us gain or relinquish control. To this, I can’t help but recall Lucille Clifton’s poem, “[Homage to my Hips](https://vimeo.com/36987057)\"—I’m constantly using this poem as a lens to help me appreciate and acknowledge my usually unconsidered body.\r\n\r\nDuring the Cinco de Mayo reading, Nuestra Ameríca, organized by Juan Delgado as part of an art show curated by Ana Delgado at[ The Institute of Ceramics and Alliance](http://humanresourcesla.com/event/the-institute-of-ceramics-and-alliance/) in L.A., we were surrounded by the beauty hands construct. The images of pan dulce, a poet ripping the trauma from their life, ceramic hand sculptures, stations to make one’s own sculptures, videos of a woman sweeping, poets taking photos, handshaking in greeting and meeting, the building itself, a writer using a combination of English and American Sign Language to share her story provided endless examples of nuestra Ameríca, our America— the reading’s title was inspired by José Martí’s [essay](https://writing.upenn.edu/library/Marti_Jose_Our-America.html) of the same name. Undoubtedly, this event couldn’t have taken place without a collaboration of hands.\r\n\r\n![Ceramic hand basin](/assets/images/hand1.jpeg)\r\n\r\n![Juan Delgado and others reading poems](/assets/images/juan.jpeg)\r\n\r\n![Ceramic hand sculpture](/assets/images/hand2.jpeg)\r\n\r\nI love the image of hands molding hand-shaped ceramic objects. The hands prepping them for the oven so the once soft hands can harden like our skin ages. Then, letting the angry, fired hands cool and, later, give them color in various shades of brown. Last year, 2017, “fire-baked” stone tools carved and used by our human-like ancestors, founded in Africa in the 1960s, were dated at 280,000 years old. Even though the _National Geographic_ [article](https://news.nationalgeographic.com/2017/06/morocco-early-human-fossils-anthropology-science/#close) doesn’t mention hands explicitly, it’s hard not to imagine these stone tools also placed in the fire by their once-young hands.\r\n\r\nSometimes I wake up and can’t grasp anything; my hands are so weak it’s difficult to open the refrigerator door. I drop everything. I make messes. I have to wrap my dog’s leash around my wrist. I have to re-imagine my world without the palms and digits I normally use without thought. When this happens, the simple of act of grab, release, push and pull become painstaking chores. Yet, I love my hands. The complexity I find written on the surface, like the pink scar my grandpa left when his burning cigarette was accidentally put out by my skin.\r\n\r\nAuthor Gary Chapman breaks love down into “[the 5 love languages](http://www.5lovelanguages.com/profile/)”:\r\n\r\n1. Physical Touch – Contact with a significant other\r\n2. Quality Time – Spending time with a significant other\r\n3. Acts of Service – Relief of burdens by a significant other\r\n4. Words of Affirmation – Compliments given by a significant other\r\n5. Receiving Gifts – Gifts from a significant other\r\n\r\nThe list above is ordered by my preferred love language. So, “physical touch” is my most important, most needed display of affection. Often, this physical touch is done with hands—hand holding, arms around shoulders or waists. Seeing hands sculpted in basins or chairs or cups during the Nuestra Ameríca reading visually validated the importance of hands in my life and the importance of them in my writing. The act of putting words on a virtual or hard surface means hands have been one of the main modes of expression used to construct who I am.\r\n\r\nWhile surrounded by the hand sculptures, I couldn’t help but trace the immense influence of hands. Their utilitarian necessity, their social importance, their personal uses. Our lives revolve around our hands while our thumbs make us inextricably human, and I can’t imagine a world without them—even though there are many whose world revolves around other body parts. For me and many others, it’s our hands that have constructed this world and these selves.\r\n"
    },
    {
      "title": "Anxiety: A Confession",
      "publish_date": "2018-05-29T21:40:48.123Z",
      "image": "/uploads/hailey-kean-zt8PJ6LT9Uw-unsplash.jpg",
      "description": "One of the least discussed barriers to writing is anxiety.",
      "body": "\r\n\r\nI’ve suffered from anxiety since I was a kid. My dad took me to the doctor because I experienced frequent “bad feelings” but didn’t have the words to say more. Dr. Yao, my family’s primary doctor and an insightful man, encouraged me to document each anxious episode on small calendars my dad left lying around from local hardware stores. Dr. Yao would flip through the months with days circled on the front and times listed on the back. My anxiety bled over their narrow margins. Yet, he never named it. Just had me keep track until he passed away some time after from a malignant brain tumor. I’ve never had a doctor look at me with such genuine understanding since—an understanding I imagine he would look at his own daughter with.\r\n\r\nMy anxiety has bled into every year, every month and most days of my childhood, adolescence and adulthood. I don’t remember a time I haven’t felt anxious. Anxiety is as predictable as the future. Sometimes the ebb and flow is manageable like a shallow puddle you step into while wearing chanclas. Sometimes anxiety is a storm that keeps you locked inside the house to escape the discomfort and danger of the outside. This type of anxiety is debilitating; it makes normal activities challenging. One of these activities has been my recent struggle with writing and submitting work to places.\r\n\r\nThere are moments I feel so unbelievably discouraged, like why do I even bother to do anything? Why do I write? Why do I send my work out? What am I trying doing? Sometimes I want a life where I go to work and just come home and watch TV. Go to work. Come home. Watch TV. Again and again. Yet, that sedentary life, my mom’s whole existence minus the drinking, is nothing like the life I imagine for myself. It just seems easy. With anxiety, however, easy is difficult to come by. So, I create.\r\n\r\nYet, I’m plagued with these questions I have no answers for. Something about writing feels necessary, essential to my being. Even though it’s hard to pinpoint why, it’s something I _need_ to do rather than _want_ to do. So, I create through the uncertainty. Even when my anxiety makes every stride to share myself with the world an arduous task, agaunto. If anxiety is a house without a door, I climb through the windows or vents to get words on the page.\r\n\r\nWhile writing this blog post, “Who cares?” and “You don’t matter,” have become crippling mantras. This is my anxiety trying to control me, trying to make me stop at every turn. So, it’s taken me hours to get anything down. I thought by confronting the anxiety, naming it, it would be easier, but it’s not. Yet, here I am. With a cloud tied to my waste like a deflated balloon. The perseverance to create stronger than the crumpling of the lining of my stomach. For what purpose, I still don’t know. Many things in life don’t need to have purpose to be worthwhile.\r\n\r\nSo, I create with or without purpose to see myself in this world in as many ways as possible. When I can, I expose these words, replacements for this being I am, to others if their willing to listen in order to better understand who I am and who I want to be.\r\n\r\nThen, just like that, the anxiety evaporates.\r\n"
    },
    {
      "title": "Turbulent Relationships: Endings",
      "publish_date": "2018-06-06T18:06:28.059Z",
      "image": "/uploads/clapperboard.jpg",
      "description": "",
      "body": "\r\n\r\nI’m not sure what’s changed, but I’ve grown to dread endings. I used to look forward to them in school, work, movies, books, but now I work to avoid them. I work to avoid the inevitable—a futile endeavor, like trying to hold water in your bare hands for long. Eventually, the book will end, the water will escape.\r\n\r\nWhile writing, my endings would come first. There was something so finite in the way I would think of poems, as abandoned islands versus a commuter friendly city. Maybe it’s because I was young, and the world seemed so compartmentalized. Everything that happened was distinct from other events. Working as a hair dresser was distinct and separate from working as a student of literature—like getting poor grades in one class, yet good grades in another. I was not able to consciously apply and transfer successful skills between roles, which my writing mirrored. Yet, now I can’t help but see the connections. Learning to be a successful communicator as a hair dresser helped me articulate myself as a student. When I learned to apply the same passion and curiosity from classes I liked to those I didn’t particularly enjoy, my grades rose. One event contributed to another event. As much as we would like to compartmentalize and organize our world, there are way more liminal spaces, spaces that fall in-between clear identities. So, I now write poems that are hard to disentangle from the one before and after. And I struggle with the question: How do I end a story that isn’t over?\r\n\r\nMy students also struggle with endings. In their youth, many of them may not have finished many things in their life to be familiar with endings. So, conclusions baffle them. I tell them it’s like an argument where you gain the upper hand by listing everything your partner has done and walking away. Not that this is the type of ending we should ever strive for, but, for many of us from dysfunctional homes, this is what relationships often look like: They are a power struggle no one wants to lose. Because the only thing that’s worse than an ending is an unhappy one. So, we’ll take any small victory we can get. And the manipulative rhetorical strategies behind writing hold the same goals. We writers want you readers to be on our side until the end.\r\n\r\nYet, endings are artificial. They are the bow that seals a present. Endings give their tellers the small pleasure of control. When, in reality, there is no pause—only a continuum. But, we all know stories can’t go on forever.\r\n\r\nI have two favorite endings: The last scene of the fourth season of Peaky Blinders, and the last few sentences of David Mitchell’s Cloud Atlas. The work and revision that went into both of these are apparent in their execution. I won’t spoil the magnificence that is Tommy Shelby’s masterful act of revenge. However, I will share Mitchell’s ending: “My life amounts to no more than one drop in a limitless ocean. Yet, what is any ocean, but a multitude of drops?”\r\n\r\nThe beauty of Mitchell’s ending is he is speaking to the continuum of experience. The way one drop is unidentifiable from another in small or large quantities of water. The way that the character Adam Ewing’s life seems inconsequential as a singular drop yet makes sense when a contributor to the “limitless.” Even though I don’t like endings, when I finish something, like Ewing, I know someone is starting something else. When they finish, another person begins again. Even though we like the artifice of an ending, we are contributing to the continuum, to the “multitude of drops.” We are opening the next rung in the ladder for the person behind us to take a step.\r\n\r\nWe all know a person who can’t let go. My mom is one of those people. My dad’s ending was and is one she can’t close. And even though there’s a progression, there is still a pause in those people’s lives. It’s like watching a treadmill gather distance without anyone using it. There is an emptiness. So, as my classes end or have ended, I have much to be grateful for. Whether I was successful or not, I’ve learned a lot and am ready to take that step. Yet, I’ll live in this momentary pause, this reflection for a bit until I have to move on again.\r\n"
    },
    {
      "title": "Notes on the Self and Helping Others",
      "publish_date": "2018-06-20T19:17:05.587Z",
      "image": "/uploads/self.jpg",
      "description": "",
      "body": "\r\n\r\nWhen I told my brother I have a blog, he scoffed, “Ugh, you’re obsessed with yourself.” And, for a long time, this is how I felt: There is no way that I can write about myself without being or becoming a narcissist. This thought kept me from writing about my experiences before, during and after my MFA. I erased myself from my writing, which caused my words to feel detached and to lack vulnerability. Now, when I read this old work, I feel the hum of repression locked behind the words. There is so much I wanted to say but couldn’t bring myself to—I was terrified of the exposure.\r\n\r\nI’m still uncertain how my brother and I have been able to coexist in the same household—we’re so different. Because of this, he reveals things in ways I never would have noticed on my own. Like, I never realized I was terrified of this self-exposure until I was talking to my brother about my class on “identity.” He thought I should incorporate more objective writing prompts for people like him “who don’t enjoy writing about themselves.” Like I was, my brother is still afraid of the exposure, of his self laid out on the open white space.\r\n\r\nFor an extra credit assignment, I had my students write a personal narrative on: “The hardest thing you’ve had to do in life.” As a student was turning this essay in, he qualified his paper with, “I feel uncomfortable writing about myself because I like to write about interesting things, and I’m not one of them.” The lack of self-worth in this man’s statement is heartbreaking, and I wonder if this is how my brother feels.\r\n\r\nAfter this student’s comment, I asked the class how many of them believed their stories were worth telling, only 2 out of the 25 raised their hands. Many of those who didn’t raise their hands, when prompted to explain why, concluded they didn’t believe there was anything special about them or their lives to give their stories value—more self-erasure.\r\n\r\nScholar Anne Fuss argues in her essay, “Essentially Speaking,” for the need to wash away personal experience from the classroom because it isolates those who can’t share in the experience. In rebuttal, feminist scholar bell hooks argues in her essay, “Essentialism and Experience,” that personal experience is critical for students’ learning in the classroom. hooks asserts that we learn through our experiences because everything that has happened to us outside of the classroom provides context for what we can discuss in class. Essentially, Fuss is trying to simplify students by making them a singular identity—a student. Whereas, hooks is trying to complicate the singular student identity by allowing them to share and partake in their own and one another’s humanity.\r\n\r\nYet, today, our education system wants us to teach our students to erase themselves from writing as if they are some nebulous, bodiless voice—also known as “academic writing.” Our students learn to exchange “I” for “one,” to write themselves out of their words to provide distance and objectivity, but who does this help? What if they never becomes an expert or someone worth believing? Then, their writing is left in the limbo of the absently present identity that is scholarly work. In this setup, students become passive, absent movers of information versus active, present sharers of information. Even though there is value in writing objectively—the ability to step out of our perspective for awhile—there is never a totally objective place. So, before our students can write brilliant essays, they need to have the confidence in their brilliance, in their voice, in their ideas and in their thoughts, which can’t be done without affirming the self.\r\n\r\nOften, we need the help of others to fully see ourselves, a term referred to as “self-expansion.” Like most things in life, we also have a myopic, self-conscious view of who we are. So, when people point out positive or negative characteristics about us, it expands our idea of the self we inhabit. In a terrifying, challenging place like the classroom, it is incredibly important to help students see themselves as students, as learners, as thinkers, and to validate these roles. One of my best students left my last spring class by saying, “Thank you for making me feel special,” and I didn’t know what to say, but she is—they all are—they just need help seeing it.\r\n\r\nSome of us, depending on our position in the world, have the privilege of being complex. Others, on the other hand, face constant obstacles that impede their humanity. hooks is trying to overcome this by allowing us to tell our stories as a way to enrich, engage and empower the classroom by acknowledging and celebrating differences instead of looking at them as exclusionary. When our students feel like their voice matters, it’s hard to get them to stop communicating. When they feel like their voice doesn’t matter, it’s almost impossible to get them to speak up. The question is, as someone who feels confident and sure, am I willing and ready to help others expand? And, I most certainly am.\r\n\r\nAs an essential form of expression in today's world, writing is a critical part of the self-discovery process. It provides that space to explore who we are both publicly and privately. So, writing has given and continues to give me a space to ravel and unravel this alien amalgamation that is identity. Even though my brother and my students don’t feel this freedom yet, I hope someday they will, and I hope that someday is soon.\r\n"
    },
    {
      "title": "The Myth of Solitude: A Writer and Her Communities",
      "publish_date": "2018-07-24T02:34:11.394Z",
      "image": "/uploads/community-image.jpg",
      "description": "",
      "body": "\r\nEarly on, I remember being fed the myth that “writing is a solitary endeavor.” It sounded almost like a curse of the craft. Unlike other arts, as a writer, I was on my own. Yet, when I go to different events, like the recent _Voices Against Violence_ exhibition, I realize the falsity of this notion.\r\n\r\n\r\n\r\nWe may write alone, but many writers rely on a community of individuals when creating a poem, an essay and, especially, an entire project. We depend on the writers we read to inspire us, on the people we interact with for material (like our families), on the folks in our writing community to help give our ideas shape, then, later, to edit our work among so many other personal and professional interactions. So, yes, we are responsible for the weight of the information we are sharing, but there are countless people involved in the process. When I’m made aware of my influences in this way, it feels almost impossible to see writing, and life, as anything but a collaboration.\r\n\r\n\r\n\r\nDuring the winter and spring Inlandia workshop sessions, my friend, Romaine, and I would stand outside of the library well after it would close enlivened by the workshop discussions. Even though I never workshopped my work as the facilitator, so many cognitive processes were taking place before, during and after the workshop that fed my writing. Meeting with the workshop members every other week made sure that I focused on writing instead of letting it fall into the periphery of importance. Because many of us don’t get paid for our writing work in anything other than love, joy and necessity, it is easy to continuously push writing to an indefinite “later.” So, after the Inlandia workshops went on break for the summer, I asked Romaine if she wanted to start a once-a-week writing session to keep us writing and accountable. \r\n\r\n\r\n\r\nThis has become an increasingly important component of my process because it means that I have a goal. Even though I constantly upload work unfinished and late, I am writing, and I wouldn’t have been this productive without a like-minded friend like Romaine. We are a small community of two, but sometimes that intimacy is enough.\r\n\r\n\r\n\r\nIn the larger scheme of things, I keep hearing people act like their individuality is attacked because they are being placed into specific communities. It’s as if the whole “pull yourself up with your own bootstraps” mentality is resurfacing. For example, someone like Kylie Jenner getting recognition on the cover of Forbes as, “[At 21, she is set to be youngest-ever self-made billionaire,](https://www.forbes.com/sites/forbesdigitalcovers/2018/07/11/how-20-year-old-kylie-jenner-built-a-900-million-fortune-in-less-than-3-years/)” is negating everyone and every opportunity made available to her throughout her life because of the actions of those closest to her. In our ever-continuously compartmentalized world, we want to see that people can seemingly make it on their own. Except, in Jenner’s case, being from a family of affluence and fame, there is no way she made it on her own. If it wasn’t for the preliminary fame of her family and the money that followed suit, the opportunities wouldn’t have been available to her in the same way. \r\n\r\n\r\n\r\nIn other words, there is nothing “self-made” about Jenner’s fortune. She is and has been a part of a wider community made up of her family, their team and the larger public for most of her childhood and all of her adult life. Without all of these communities working together, there would be no money to acquire. All this_ Forbes_ coverage is doing is feeding into the idealized notion of “individuality,” the you-don’t-need-help-from-anyone-to-get-somewhere attitude. At some point in everyone’s life, we receive something from someone. Whether it is our family’s wealth and notoriety or an encouraging and thoughtful English professor in our undergraduate program, someone was there to help us out. \r\n\r\n\r\n\r\nJust like the act of writing may seem “solitary” at first glance, so does life. However, when we start tracing the influences and opportunities that have made us who we are, we will all be hard-pressed to attribute our personhood solely to our own construction. From the moment we are born, we depend on the community we are a part of—our families, our neighborhoods, our cities, our states, our governments…etc., which all help us develop an aspect of identity. Even if we are choosing not to be a certain way—just like being apolitical is a political stance—we cannot ignore the influence that allowed us to make that choice. \r\n\r\n\r\n\r\nI was reminded of this idea during the _Voices Against Violence_ exhibition that opened Sunday, July 15th. I was a workshop leader along with three other folks, and to see our work displayed together felt like another display against violence since the unison of our projects fit so well together I couldn't have imagined not being apart of the group. For my workshop, I wanted to highlight the people I worked with. Without them, I wouldn’t have been able to create my project. So, I incorporated images of most of the participants into a larger banner. In this way, the audience was able to their signs and attach a person to the message. \r\n\r\n![Image of the Voices Against Violence project display.](/assets/images/img_0679.jpg)\r\n\r\nAs a writer who works in the community like this, the idea of writing as a solitary endeavor seems especially untrue for me. \r\nI am an individual who is constantly moving in and out of communities. These identities never make me feel less of a person, they actually help me feel more like myself because I have a space for each aspect of my identity. I’m not sure if any one group will allow us to be fully ourselves, which would be exhausting anyway. So, I appreciate the communities I am a part of making themselves available when I need them."
    },
    {
      "title": "Finding Magic",
      "publish_date": "2018-10-02T21:54:38.196Z",
      "image": "/uploads/cristian-escobar-abkEAOjnY0s-unsplash.jpg",
      "description": "To write is an act of revealing one's self to the world and themself.",
      "body": "\r\nI am no expert on magic. Yet, I know it can be easily lost—especially under the pressure of drastic change. \r\n\r\n\r\n\r\nEver since I was young, I’ve been threatened by my family and friends that my optimism and love for this world and the people in it will eventually dry out and erode under the pressure of circumstance. After breaking a leg and a subsequent surgery, I was worried this might finally be what they’ve always warned me about. This might be the time I lose the incandescence that warms my stomach since so much has changed and keeps changing. \r\n\r\n\r\n\r\nBecause of this, I am grateful for the many folxs who have turned this worry around with: “At least you have time to write.” And, yes, I do. I’ve been writing and reading. Letting the magic of others draw me into their lives, which has become a reprieve from my own. The first book I finished was Carmen Maria Machado’s collection of dark short stories, _Her Body and Other Parties_. Reading this hurt. In almost every story, Machado reminded me of all the ways woman are trapped and haunted: mentally, physically, socially, politically, amongst others. \r\n\r\n\r\n\r\nHaving spent two weeks in the house, many days spent unable to go outside, this theme bit me. Yet, I savored each of Machado’s words. I’d limit myself to only one short story every night in order to preserve the exploration and self-realization as long as I could. A student showed me the term “[benign masochism](https://scopeblog.stanford.edu/2015/08/04/benign-masochism-motivates-common-strange-behaviors/).” This is a phrase that means we’ll torture ourselves as long as we won’t actually be hurt. And, this is Machado for me. This is every devastating movie I watch that rips my tear ducts open. This is eating too-spicy food but enjoying it. I, we, love pain as long as it isn’t dangerous.\r\n\r\n\r\n\r\nTo continue this self-infliction, I’ve been writing prose poems about my childhood, about my mom and brother. My masochistic goal for each of these poems is to make myself cry. I want to ensure vulnerability, and this is the only concrete criteria I could think of. Tears become the main ingredient for these poems’ magic. Each poem is a potion, which should do only one thing: Be so vulnerable it helps the reader see themselves or their lives in a different or better way. Tears are my offering to my reader, the poem an altar. (No matter how far I move away from religion, I find new sacred beds.)\r\n\r\n\r\n\r\nSometimes I wonder why I’m even telling these stories. Since, now that I’ve started, I can’t stop. But, like many things in life, the feeling of importance is there even though the words haven’t settled. As long as I’m able to pull these stories out and shape them into words, I don’t care. The pain feels good. The pain is real and unreal. The pain is old pain that reopens but is no longer dangerous. Sometimes, the pain is so overwhelming it feels newly dangerous, which outweighs any ache my post-surgical nerves can conjure. \r\n\r\n\r\n\r\nAs I’m writing this, I realize I’m writing these poems to understand myself better. The use of \"the reader” earlier was a reluctance to reflect. A move away from vulnerability. An unwillingness to flay myself raw. All of which is the key to magic. All of which can be done from a bedroom with a casted leg balanced on a tower of pillows. All of which can be done in the hazy state of Percocet."
    },
    {
      "title": "On Listening: The Role of Paying Attention When Writing",
      "publish_date": "2018-11-11T22:45:40.172Z",
      "image": "/uploads/earimage.jpg",
      "description": "There is a misconception that writing is \"...an art of speaking.\" In actuality, writing, poetry specifically, \"is an art of listening,\" which makes listening to the world around us especially crucial.",
      "body": "n\nIn order to write, one must listen for the stories. To this effect, poet and critic Craig Morgan Teicher claims, “Though it seems, at first, like an art of speaking, poetry is an art of listening,” in his new book exploring becoming and being a poet, [We Begin in Gladness](https://www.graywolfpress.org/books/we-begin-gladness). Much of writing is being able to identify the stories in the world around us. They’re there hidden within the neighbor who is stuck in a wheelchair and screams at the dogs in frustration or the brother who leaves every project unfinished until he decides he will remodel his mother’s house and actually finishes it. Our world is teaming with stories, but sometimes the wind blows their song away from us instead of toward.\n\nThe wind isn’t our only impediment to the cuentos surrounding us, we are our biggest wall. It is easy to go inward when one is talking—to follow the cryptic trail of recollection. The other evening, my partner was talking about mushrooms supplements, which piqued a memory of my dad sautéing baby bellas for him and I with a stick of warm butter. My mom and brother’s dislike for mushrooms made them our thing. Something me and him would rejoice in almost every meal. And, just like that, I missed my partner asking whether we should buy a mushroom supplement bundle or only a bottle of [Lion’s Mane](https://medium.com/optimal-living/health-benefits-of-lions-mane-mushroom-36051ee5fd0). Many conversations begin and end this way.\n\nOur inner thoughts not only distract us from the outside world, but it makes it difficult to listen to our authentic self amidst the rambling. Treicher goes on to say, “It can take a long time to learn to let this voice speak without getting in its way.” By “this voice,” Treicher is referring to the poet’s inner voice that takes in the world, which one should learn to listen to “clearly and…without interruption.” As I was reading poems from various projects, I could see the difference between poems I have gotten in the way of versus one’s that I have not. Unfortunately, the former is more common.\n\nThis is the challenge: How do we learn what to give attention to when we write poems? Treicher continues to discuss this “attentiveness” to one’s self as “poetic development, and it is the substance of the poet’s art.” However, he acknowledges that this act of listening is one of “slow learning” and “this growth is rarely steady, never linear, and is sometimes not actually growth but diminishment.” So, it seems whether or not a poet learns to listen to their authentic self, one is still destined to struggle with the unceasing caverns of “poetic development.” I find this both comforting and anxiety-inducing, yet Treicher describes it as “part of the compelling story of a poet’s way forward.”\n\nSo, I try to remind myself that I must listen and listen intently because, even if it seems like I’m not moving anywhere, the stories, the poems are waiting to be heard.\n"
    },
    {
      "title": "A Struggle: Writing About the Positive",
      "publish_date": "2018-12-23T05:00:41.879Z",
      "image": "/uploads/bp11image.jpg",
      "description": "It is tempting to write about the painful aspects of life, but we must not forget the need to also write about the positive aspects no matter how self-indulgent they may feel.",
      "body": "\r\nLike many, or possibly most writers, I am tempted to write about trauma or struggle or pain. After some distance from the event or emotion or both, there is something healing about finally putting these stories on the page. A transference occurs between something that was solely inside me into a shape also recognized to the outside world. I become a little freer from the pain, better able to dissect it and see what makes it come alive. \r\n\r\nGetting this far in the process of transcribing my emotions may or may not happen, but, when it does, I am empowered by this action and the release that follows. Writing about the devastating parts of life is more than challenging, it is an act of excruciating vulnerability. Yet, writing about the happiness or joy or excitement or reverence I feel in life is much more challenging to take on.\r\n\r\nI recently wrote [an essay](https://www.pe.com/2018/12/09/replenishing-your-art-will-also-replenish-your-much-neglected-soul/) about the importance of retaining and preserving one’s soul in our work life based on David White’s argument in [_The Heart Aroused: Poetry and the Preservation of the Soul in Corporate America_](https://www.goodreads.com/book/show/871728.The_Heart_Aroused?from_search=true). The religious undertones inherent in the word “soul” still makes me internally squirm. But, I couldn’t help but identify with White’s argument about the importance of this elusive foundation of the self and the need for its preservation at all costs. \r\n\r\nAt first, this essay was an attempt to understand how the busyness of life has washed away certain aspects of myself—like my love and need to write. Then, it became important for me to write through the discomfort (and cheesiness) of the subject matter, which made me question why I felt this way to begin with. I realized it’s because I'm not accustomed to celebrating or promoting positive aspects like happiness in my life—just as it is informally poor social form to answer anything but “Good!” when someone asks us how we are doing.\r\n\r\nThere feels to be an acceptable social state of being so as not to make other people uncomfortable. It’s acceptable and encouraged to be reasonably happy; however, it is frowned upon to be too publicly sad or angry. When writing, though, the inverse occurs. With the rise in popularity of the personal essay, it is now acceptable to write about difficult life situations, like abusive parents or the atrocities of capitalism; however, it is uncommon to explore the happiness or joy in our lives, like pulling over to help someone change a flat tire. It feels like boasting to share this action. Worse, it can even come across as inauthentic, as one's desperate desire to be praised. This is unfortunate when happiness and joy are two things women, especially women of color, are lacking due to the rigid gender constructs of society according to Jill Filipovic’s exploration of feminist happiness in her book, [_The H Spot: The Feminist Pursuit of Happiness_](https://www.goodreads.com/book/show/31934541-the-h-spot?from_search=true). If helping someone change a flat tire made me feel good, why do I feel uncomfortable celebrating this action and consequential feeling?\r\n\r\nSocial media, like Facebook and Twitter, however, has challenged these notions of what is and what is not acceptable to share by creating a space to publicly highlight our successes, which has gone awry since this has also led to a rise in self-esteem issues for the youth (again, especially young women) and “[diagnoses of narcissistic personality disorder](https://www.theguardian.com/world/2016/mar/17/i-narcissist-vanity-social-media-and-the-human-condition).” Even though this correlation in both diagnoses doesn’t necessarily prove causation, the tendency of those on social media to highlight the positives in life does distort the reality of living, just as focusing on the negative can make the world feel much darker than it is. \r\n\r\nI want there to be a balance. Life is a hilly terrain of emotional intensity and emotional calmness across the spectrum of feeling, happiness and joy being ones I feel uncomfortable focusing on more than I should—especially when writing. So, I’ve given myself permission to write more about the positive occurrences and push passed feeling like a braggart.\r\n\r\nHere it goes. \r\n\r\nI received one of the most beautiful reflections from a student this past semester in a critical thinking and writing class exploring the concept of love:\r\n\r\n![\"Most important was that I was able to learn more about love because before this class looking at the world seemed gloomy but this class actually made that better and I think you for that. #OneLove\"](/assets/images/screen-shot-2018-12-17-at-11.06.40-am.png \"Reflection by student\")\r\n\r\nThis student is speaking directly to the gloomy shadow that can distort the beauty of life, yet my class helped them see a brighter version. This unexpected reflection made me cry and proved the need to focus more on the positive. Because, if our youth don't see the aura of optimism in life, what hope is there for the rest of us?\r\n\r\nWe all need to feel good about this world, which can help someone when we least expect it. And, this carries a different yet vital worth than the essays exploring topics like the unhappiness of my mother. It will take some time for me to get comfortable with this idea, but I know I must. Because lighting a candle for ourselves becomes lighting a candle for others, and we all know how lonely the darkness can feel.\r\n"
    },
    {
      "title": "Writing is Overwhelming, But It Doesn’t Have to Be",
      "publish_date": "2019-01-07T06:04:29.313Z",
      "image": "/uploads/adult-blur-books-close-up-261909.jpg",
      "description": "Writing is overwhelming, but it doesn't have to be if learn how to effectively learn how to break a project down, know what questions to ask and realize you don't have to write ​about everything.",
      "body": "\nWriting is overwhelming and stressful no matter what stage a writer is in. It can be difficult to start writing or challenging to keep an idea moving forward or stressful to end with a good kicker or a combination of these and other roadblocks. One reason for this is the immense critical power it takes to turn our non-linear thoughts into a linear form. Our thoughts naturally jump from one idea to another as our synapses are stimulated by the environment around us. Conversation is loose and normally directionless. Effective writing (outside of forms like stream of consciousness) is something else entirely. This requires us to be clear, cohesive, and logical, which we know or intuit is a lot of work. Outside of these instances, another culprit, for me, is the pressure to know _everything_ about a subject to get it “right.” Sometimes it’s difficult even to know what “right” is though. \r\n\n\r\n\nWriting is exploratory. The more I write about a subject, the more I learn. This learning is mostly comprised of in-the-moment research when I realize I don’t know enough to make a reasoned judgment or supported claim. As I’m researching, the pressure to know _everything_ about an issue before getting started, like childhood abuse and trauma, is real and paralyzing—especially when I only have an idea with little or no direction to take it. I can become so paralyzed by the fear of not-knowing-enough that I will put the topic away in my “IDEAS” folder and never get back to it. \r\n\n\r\n\nPutting a piece down, for this reason, is common and unfortunate. Today, we have more access to information than any other generation in history. According to Richard Alleyne from _The Telegraph_, the information we consume on a daily basis equated to about 174 newspapers in 2011. The overwhelming feeling we experience because of the seemingly limitless amounts of information is a real cause for concern and anxiety. Yet, the internet is such a vital tool for the search and acquisition of information, and the fact that this information is accessible to any person with a smartphone is an immense privilege. First, though, one needs to have the necessary skills to take advantage of this resource. \r\n\n\r\n\nTo overcome this feeling of being overwhelmed when confronted with a new and unfamiliar topic (or even an old and familiar topic) depends on one’s knowledge of and ability to break down a project into manageable pieces. Teaching helped me do this for the sake of my students’ success and sanity—i.e., no one is expected to write a “perfect” essay from the start—which inevitably helped my own projects. Writing is messy and requires so much thought and preparation and revision before it gets anywhere near “good enough” let alone “perfect.” So, once we learn how to break something large into smaller pieces, anything is manageable. Part of this manageability is determining the right questions to ask ourselves. For example, when starting a research project, you might:\r\n\n\r\n\n* Think of a list of topics you’re interested in\r\n* Narrow this list down to the most attractive (Top 3)\r\n* Do some light research to see what types of information is available\r\n* Then, choose the topic with the most exciting and diverse information\r\n* Determine what you WANT to know about this topic\r\n* Develop a research question that is specific enough to find information that sufficiently answers this question\r\n* Then, begin breaking this question down into manageable minor questions\r\n  * My go-to for this is answering the basic questions: _Who? What? When? Where? Why? How?_\n* Finally, you can begin in-depth research on your topic.\r\n\n\r\n\nThis isn’t the only way to break down a research project, but this is a strategy that helps me and my students get started. Often times, many of us aren’t given enough spaces to figure out this process on our own. When seeing a prompt, many students tend to fall into a spiral of hopelessness, anxiety, and fear—much like I do when starting my own projects. We end up just getting stuck in the overwhelmed state unable to move forward. Yet, once we start breaking the project down into the above steps as a class, these emotions begin to dissipate as well. Usually the anxiety and fear do not disappear completely, but the students have moved passed the more significant hurdle of figuring out an initial direction at least.\r\n\n\r\n\nOnce we break down our projects and develop a direction, the next step is generally finding out more about our topic, which typically requires some to _a lot_ of reading depending on our initial level of knowledge. According to James Baldwin, “One does learn a great deal about writing this way. First of all, you learn how little you know. It is true that the more one learns the less one knows. I’m still learning how to write. I don’t know what technique is. All I know is that you have to make the reader see it.” Just like narrowing a topic, reading can lead to another overwhelmed state. But, when reading is paired with asking the right questions, we have a better chance to keep ourselves moving forward. \r\n\n\r\n\nAnother part of managing the feeling of being overwhelmed is realizing you don’t have to write about every aspect of your topic; only what pertains to your initial question or interest. There’s always another essay or poem or screenplay that can pick up where you left off. Next time you’re feeling overwhelmed, step back and ask yourself, as my fiction instructor Merrill Feitell used to demand, “What are you writing _ABOUT_?” Knowing this, you will understand the general direction you’re taking your subject, and you will have some parameters to ignore anything that doesn’t fit the course. \r\n\n\r\n\nWriting is about entering conversations that have been undertaken long before us and will continue (hopefully) long after us. As we write, we create our own unique perspective to extend and complicate this discussion. Managing the feeling of being overwhelmed helps a writer keep moving forward. Rarely is there one absolute “right” way to do something when it comes to writing (within reason, of course). It’s more about finding what’s right for us—like relationships or the texture of pasta. However, learning how to break projects into smaller, manageable pieces is something we can all use and get better at. If not, nothing would ever get done.\n"
    },
    {
      "title": "Just Like That: Moving Without Confidence",
      "publish_date": "2019-01-23T19:17:17.034Z",
      "image": "/uploads/30daysreplay-pr-marketing-gAajYgoEci8-unsplash.jpg",
      "description": "Confidence is not a necessary ingredient to getting things done. Actually, we get most things done without it.",
      "body": "\r\nI’ve never seen the point in jumping on the “New Year, New Me” bandwagon. On a social level, New Years’ is made out to be a “fresh start,” a “new beginning.” Personally, it feels like any other day. I don’t think it’s useful or healthy to attempt to turn ourselves around only once a year. Personal growth should be a habit. A New Years’ resolution is a great start for continual, long-term growth, but they usually [aren’t sustainable](https://www.forbes.com/sites/ashiraprossack1/2018/12/31/goals-not-resolutions/#3973e5fc3879). This is why this post wasn’t my first post of the year. I wanted some time to give myself a goal that was achievable and could start whenever I was ready. The goal I decided on is:\r\n\r\nI will listen to the insecure voice that pops in my head, but I won’t give it weight.\r\n\r\nIn an interview with Roxanne Gay, [“Roxanne Gay: ‘If I was waiting for confidence to write, I’d still be waiting,’”](https://gal-dem.com/roxane-gay/?fbclid=IwAR1yJGl_inr2uPh_wwMvcOYokkjbNe7AyVmi_ZUV-LjR7VWON2odnBlRvF4) the title immediately implies confidence in one’s self and one’s writing is elusive and unreliable. The title also suggests the writing process is vulnerable and uncertain. Much of my writing process fills me with a recurrent cycle of this vulnerability and uncertainty, which caramelizes into a lack of confidence. Sometimes this confidence comes from feeling unprepared and [overwhelmed by my topic](https://www.allysonjeffredo.com/overthink-a-blog/writing-is-overwhelming-but-it-doesn-t-have-to-be) to fearing I’m a shitty writer--among many other [feelings of anxiety](https://www.allysonjeffredo.com/overthink-a-blog/anxiety-a-confession) and insecurity. To know that someone as prolific as Roxanne Gay (I feel I must always refer to her by her whole name) feels the same way is both comforting and saddening. It’s important to know the struggle is universal, but it’s also unfortunate that this lack of self-trust and self-belief is an everyday reality. In an ideal world, we, women, would trust ourselves because we’re the only individual we know so thoroughly, back of hand, thighs, belly. Because of this overwhelming trust, we would have an unyielding belief in ourselves, too. \r\n\r\nIn this society—a rather unethical one based on making us as insecure as possible for many oppressive reasons like to buy things we don't need—the struggle with confidence crosses over into everything we do, like writing, teaching, speaking, breathing, eating, laughing, crying, angering. I even feel unconfident about walking having been kept from it in the last four months since I broke my leg. The prickling sense of self-doubt tarnishing each step. \r\n\r\n“I’ve never waited for the confidence to do anything, because if I was waiting for confidence, I would still be waiting,” expounds Roxanne Gay. There’s so much to acting without thinking _too much_. I can’t think of an everyday situation where thoughtfulness and consideration aren’t welcomed. Yet, at one point in the thinking process, a boundary is crossed to the _too much_ realm. As a chronic overthinker, I know this process well. There has to be some implicit self-belief that helps us turn off the over-thinking drive that allows us to act without confidence. That something is what Roxanne Gay points to, and that something is always _us_.\r\n\r\nWhen British writer/interviewer Micah Frazer-Carol asks how a young writer finds their voice, Roxanne Gay replies, “It’s not necessarily something you find…It’s something that’s in you and you allow to emerge. Oftentimes people go looking here or looking there, instead of just recognising that they already have the voice, and they just need to use it.” Because of this, everything we need, our voice, our strength, our courage, is already within us. This is how Roxanne Gay and many of us can move forward without an explicit sense of confidence because we don’t need it when we use the tools we already have. \r\n\r\nThere is an innumerable amount of reasons for not doing the things we want to do. But, we don’t have to give these reasons weight. I’ve been successfully keeping the unconfident voice at bay. By successful, I mean, I hear it, but I keep from listening to it. Sometimes I begin to give in. I’ll give this surrendering a few minutes max. Then, I’ll start or pick up where I left off. Using this formula, I went on my first solo drive today. I was scared. But, I got into the car. Hurriedly turned it on and put it in reverse before the surrendering could set in. All I could think as I rolled into the street with my ache-y foot on the brake was, “It’s happening.” Just like that, I drove to lunch and to my first physical therapy appointment. Just like that, my life is returning back to normal. Just like that, is also how we get the first words on a page or paint on a canvas or the chaotic rhythms of a first job. Just like that.\r\n"
    },
    {
      "title": "Find a Perspective that Helps You Ask More Questions",
      "publish_date": "2019-02-08T04:43:54.015Z",
      "image": "/uploads/cup.jpg",
      "description": "Asking questions is the way to finding and developing our perspective of the world.",
      "body": "\r\nMuch of life is about perspective—often captured in the whole “glass half empty, glass half full” adage. A portion of our view can be attributed to our overall satisfaction with life. If I see the glass as half empty, I am dissatisfied with the lacks. If I see the glass as half full, I am satisfied by what’s present. Though, it’s not so much about the perspective itself than it is about the questions our perspective invites or repels.\r\n\r\n> _How thirsty am I? Is there more water available to refill the cup? Do I want more water because I am accustomed to getting more than I need so I can get my money’s worth?_\r\n\r\n I find myself in this dilemma when McDonald’s offers $1 any size drinks. When I know that I will not finish anything larger than a medium, everyone in the car insists I should still get the giant, unconsumable-before-the-ice-melts extra-large. A consumerist society is always dissatisfied with just enough. The capitalist cup is designed to leak.\r\n\r\nThis parasitic focus on “never enough” leads to a compartmentalized approach that keeps us from seeing the interconnectedness of life. If we’re hyper-focused on what’s missing, it’s unlikely we’ll get to the big picture. In _The Wretched of Earth_, Frantz Fanon credits this myopia to the colonialist’s tactic to isolate, divide, and conquer. If we can’t see how the inner workings are connected, those in charge will never be discovered. The ability to escape accountability is only one take away though. Research suggests it would take only [3.5% of a country’s population ](https://www.theguardian.com/commentisfree/2017/feb/01/worried-american-democracy-study-activist-techniques)to bring about large social change, like toppling a dictatorship. That’s only 11.4 million in the US. The lack of hope that both causes and stems from the self-deprecative question, “Well, what difference can _I_ make anyway?” is another side effect of a stringently compartmentalized world view. Without hope, how could one even begin to ask for more?\r\n\r\nHope is a privilege. It is an “expectation of something desired; desire combined with expectation,” according to the OED, which gets into the glass-half-full people’s optimism, while the glass-half-empty people’ pessimism. I’m frequently told how optimistic I am, but I’m searching for a perspective that forces me to go beyond the surface. I’m after a perspective that doesn’t shut me off to questions, options, doors, windows, chimneys, basements. I want a way out or way in whenever I need it. When I look at a blackbird, I want to see it from 13+ vantages. When I think of suicide, I want to look at it as a desperate desire to start over versus giving up.  \r\n\r\nI’m convinced our perspective isn’t initially a choice. It is molded by our families, communities, and environments from the moment we’re born. As social creatures, we need this. As social creatures, we’ll also go too far to fit in. At some point, one can only hope for a shift towards an awareness that acknowledges the ease our perceptions can be altered—by ourselves and by others. The grandfather of public relations,[ Edward Bernays](https://youtu.be/DnPmg0R1M04), Sigmund Freud’s nephew, understood the power of manipulating the masses through Freudian suggestion (Serendipitously, his application of Freud’s ideas is what made Freud so well known). Today, we’re exposed to somewhere [between 4,000 to 10,000 ads per day](https://www.forbes.com/sites/forbesagencycouncil/2017/08/25/finding-brand-success-in-the-digital-world/#7d05283a626e). Our perception of the world is made heavy by the imposition of others. \r\n\r\nThe scourge of manipulation is like being caught in a storm unprepared, canvas shoes, shorts, no raincoat, no umbrella. Something a simple fore-question could’ve prevented: \r\n\r\n> _What’s the weather going to be like today?_\r\n\r\nOur perspective determines how we see the world, but our questions help us scuff its smooth veneer to reveal it’s not glass but a funhouse mirror that bares what we want to see.\r\n"
    },
    {
      "title": "Reflections on Being Back in the Classroom",
      "publish_date": "2019-02-22T18:54:35.853Z",
      "image": "/uploads/nikolai-chernichenko-hFBsF-CX5eQ-unsplash.jpg",
      "description": "Even with all the systematic issues surrounding the classroom, teaching is worth it.",
      "body": "\nThis is my second week back in the classroom, and it reminds me how much I love teaching. I love how the class reverberates with nervousness on the first day but begins to bloom on the second. I love watching the hardness melt away as the students start to talk with one another. I love seeing them fight through apprehension as they contemplate whether or not to raise their hand for class discussions. Out of all the environments I’ve been in, nothing beats the joy a successful classroom carries.\r\n\n\r\n\nI’m embarrassed to admit that I never wanted to teach. I loved English. It was always a subject that held me close, but teaching never captured my attention. As an English major all through college, I grew sick of being asked about being a teacher. I grew even sicker of not knowing exactly what I would do when I graduated. Both of these combined into a distaste I couldn’t shake for the field until I took English 511 at CSU San Bernardino. In this class, informally called SCIPP, I taught creative writing and art to elementary students. From then on, I was hooked. Like many folks, my younger self had yet to realize the intellectual magic that can happen in the classroom. Because, paradoxically, even though we’ve spent much of our life at school, being in charge of one changes one’s entire perspective of what goes into teaching.\r\n\n\r\n\nIf one of my utopian dreams could be met, it would be a shift in societal reverence towards the education system. The reality, unfortunately, is that education is not revered. It is instead dismissed as supplemental. Something that could be carved out until there’s little left. Teachers across the country continue to fight for basic dignities like living wages and classroom resources. The recent [Oakland teachers’ strike](https://www.vox.com/2019/2/21/18233377/oakland-teachers-strike-2019) and [West Virginia teacher’s strike](https://www.vox.com/2019/2/19/18231486/west-virginia-teacher-strike-2019) are immediate examples of this. With the vast amounts of information that we know collectively as a species, the consistent loss of funding of education as a whole, the skyrocketing prices of higher education, and the overall lack of investment both institutionally and socially in education is disheartening and dangerous. I have my personal conspiracy theories for why this is, but whether it’s just ignorance or intentional oppression, inaccessible and inadequate education creates huge systematic problems and reinforces pre-existing ones. \r\n\n\r\n\nIn higher education, there’s also a problem with the dependency of part-time adjunct instructors who receive merely a fraction of the benefits and support full-time faculty do with all the same qualifications. Like in primary and secondary education, the lack of investment in instructors hurts everyone involved—students, part-time instructors, full-time instructors, the college, and the society we live in. The devaluing of one group means that every other faction is susceptible to devaluation. And, we’ve experienced the consequences of this reality for some time, such as [state funding going down and the prices of tuition rising](https://www.insidehighered.com/news/2017/07/24/new-study-attempts-show-how-much-state-funding-cuts-push-tuition).\r\n\n\r\n\nWith all of these overarching systematic problems, teaching is still one of the most rewarding endeavors I do. This is both a blessing and a challenge since folks can’t feed themselves and pay their bills with joy. Yet, I overlook these issues with every rewarding encounter I come across, like a student leaving my class with a more [positive outlook on life](https://www.allysonjeffredo.com/overthink-a-blog/a-struggle-writing-about-the-positive). There’s also a sense of reward from my own growth in the middle of my third year of teaching. This is the first semester I’ve prepped and readied all of my materials before my class started. I’m satisfied with my schedule, and I printed ALL of my major writing assignments plus corresponding resources for each. It feels good to be so organized. It feels good the students feel good with the organization of the class. Even with all the institutional issues, this good feeling and the love carries me.\n"
    },
    {
      "title": "Acknowledge the Womxn in Your Life",
      "publish_date": "2019-03-09T02:29:38.970Z",
      "image": "/uploads/womxn.jpg",
      "description": "Acknowledge the worth and power and holiness that is the womxn your life, and remember every day is Womxn’s Day.",
      "body": "\r\nMy friend recently told me a story of erasure, of invisibility. One that is common for many womxn—especially those of color. She had dinner with a man who she’s met at numerous poetry readings and with whom she has sat through an entire workshop. For the life of him, he couldn’t remember her. \r\n\r\nOne wouldn’t call this man misogynistic. One may even call him a feminist, an ally. \r\n\r\nYet, there he was fully formed as both a memory and a person. And, there she was, unrecognizable, non-existent. \r\n\r\nThis erasure happens to most of us, womxn. I am frequently blotted out. At least enough to be a nuisance but not enough to be life-threatening like the reality of many others. To counter this, I introduce myself to the familiar as, “Hi, I’m Allyson. We’ve met before at \\_\\_\\_\\__.” Sometimes this is enough to burst through the ego and shake a memory awake, but, usually, it is only feigned remembrance. The lack of memory leaving their face blank.  \r\n\r\nOr, sometimes if I’m positioned next to a man, I might as well be as sentient as the door or wall or table we’re surrounded by. There’s no need to blend in when people don’t see you or pretend not to. The paradox of attention is it doesn’t mean I’m really _seen_ anyway. \r\n\r\nThese situations used to ignite an anger so powerful within me I’d have to nap afterward. A physical response to insignificance. After I’d recharge, I’d have this urge to declare my personhood by doing anything to combat this sense of non-importance. Until I realized this is a battle against the patriarchal machine. The only way to combat this is to make sure I don’t make invisible anyone else. Each person, hopefully, contributing to the change we need.\r\n\r\nThe problem with the invisibilia of womxn has been a mainstream conversation brought to light by Stephen King’s [tweet](<https://twitter.com/StephenKing/status/1101115032308461568?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1101115032308461568&ref_url=https%3A%2F%2Fwww.goodmorningamerica.com%2Fculture%2Fstory%2Ftabitha-king-calling-calls-stephen-kings-wife-61409581 >): “My wife is rightly pissed by headlines like this: ‘Stephen King and his wife donate $1.25M to New England Historic Genealogical Society.’ The gift was her original idea, and she has a name: TABITHA KING...” But, the washing away of womxn from the typeface of society is an age-old trend highlighted by movies such as [_Hidden Figures_](<https://en.wikipedia.org/wiki/Hidden_Figures >), which sheds light on the many black womxn, like Katherine Goble, Mary Jackson, and Dorothy Vaughn, that contributed and propelled John Glen into space. \r\n\r\nIn the remarkable reversal that privilege evokes, men say they’re now [“scared”](<https://www.theguardian.com/commentisfree/2017/dec/12/me-too-american-men-scared-women-criminalize-fear >) to speak to womxn in the age of #MeToo—the founder of #MeToo, Tarana Burke, an [initial victim of erasure](<https://www.bostonglobe.com/lifestyle/2017/10/17/alyssa-milano-credits-activist-tarana-burke-with-founding-metoo-movement-years-ago/o2Jv29v6ljObkKPTPB9KGP/story.html >) when she was overshadowed by movement proponents such as Alyssa Milano. If I eyerolled any harder, I’d rip my own eyes from their stems. Womxn are in a continuous battle to be seen and heard and acknowledged, and some men will do anything to maintain the status quo. If womxn have the audacity to stand up to this machine, they are [mercilessly dragged](<https://www.thecut.com/2018/11/christine-blasey-ford-threats-gofundme.html >) like Dr. Christine Blasey Ford during and after her testimony against Brett Kavanaugh’s Supreme Court’s nomination. If they have the audacity to speak their mind, they’re [cruelly targeted](<https://www.washingtonpost.com/politics/2019/03/02/poster-linking-rep-ilhan-omar-sparks-outrage-injuries-wva-state-capitol/?noredirect=on&utm_term=.9bb0644c4aee >) like Rep. Ilhan Omar. Or, worse. Killed or assaulted like activist [Malala Yousafzai](<https://en.wikipedia.org/wiki/Malala_Yousafzai >).\r\n\r\nIn some twisted turn of historical events, many womxn have been wiped out of history, and the social ramifications of this removal continue to this day. Womxn are the foundations of this world from their god-like abilities to hold life in their bodies to the incredible emotional labor they freely give. Most of which is eclipsed by the mediocrity of the patriarchy. I’m also not going to pretend that my relatively low-stakes erasure as a cis womxn is worse than the erasure non-binary folks face. Cis womxn are the ghosts in the patriarchal ether, but the real invisibility across the spectrum of issues is held in the gender queer demographics. \r\n\r\nToday is officially International Women’s Day, but Womxn’s Day is every day. So, acknowledge the womxn and non-binary folks in your life. Acknowledge us regardless of our credentials. Acknowledge us whether we are useful to you or not. Acknowledge us even if it makes you uncomfortable. Acknowledge us because it makes humanity your priority before your most likely underestimated judgment of our worth.\r\n"
    },
    {
      "title": "Privilege Isn’t a Bad Word",
      "publish_date": "2019-03-30T03:06:35.554Z",
      "image": "/uploads/privilege.jpg",
      "description": "We all have privileges we must acknowledge to make social progress this world desperately needs--even if it is hurtful and angering to do so.",
      "body": "\r\nYet, in a “pull yourself up by your bootstraps” society like ours, we treat it like one. \r\n\r\n\r\n\r\nAt the foundation of individualism, there is the embedded idea that everything we have earned we have gotten with our bare hands. In this equation, our hard work equates our deservingness, our merit. The harder we work, the more we deserve, the more we are worth. And, thus, meritocracy is born, thrives, and excludes based on our happenstance access to resources that is mischaracterized as “work.”\r\n\r\n\r\n\r\nWhen privilege is defined as one’s unearned characteristic or experience that sides in one’s favor, it can manifest in different, yet equally, unearned ways: Race, sex, class, gender, sexual orientation, upbringing, socioeconomic position, and attractiveness among so many others. The privilege of being born male in a patriarchal society means that men implicitly benefit from this system. Men are taken more seriously in the workplace, more likely to hold positions of power, and more likely to receive higher annual incomes. Men didn’t _earn_ these benefits. It was a biological fluke. Yes, many of these men likely also put in “work” for these benefits, but, the combination of luck and work doesn’t remove the benefit from the table. The same can be said about being born to fit the era’s beauty standards. The same can be said for growing up in an economically stable household and an affluent neighborhood. Maybe one’s parents worked for this, but the beneficiary, the child, did not. Therefore, this is a privilege. \r\n\r\n\r\n\r\nIndividualism is such a deeply held belief that our [amygdala](https://theoatmeal.com/comics/believe) doesn’t take kindly to our privileges being called out. In fact, calling out one’s privilege is a sure way to set someone on instant defense. The burst of the illusion our life’s work may not be the driver of our success is quickly mistaken as an attack. Identifying our privileges pokes so many holes in a meritocratic society it leaves the balloon ragged on the floor. And, this is a scary thought. It means we have to ask, “So, you’re saying that no matter how hard I work, I may never be as successful as all the white, rich, privileged men I’ve been taught to idolize?” Yes, that’s precisely it. Because our system has been bred to privilege those it always has: White, rich, straight, Christian men. \r\n\r\n\r\n\r\nMost difficult is that identifying privileges accompanying our identities is a direct way to determining the power structures of the sociopolitical systems we are a part of. Most American social myths we’ve been taught don’t hold up under the magnifying glass, and that is world shattering. It directly indicts us in these systems—especially when we benefit. It places the conjoining myths of “equality,” “freedom,” and the overall “American Dream,” up for debate as well.\r\n\r\n\r\n\r\nSo, what do we do with our privilege? First, we must accept this as a social reality. Every group benefits from the oppression of another in some form. Therefore, we all have some sort of privilege. Most important to remember, this privilege in no way erases our hardships and suffering. The goal of identifying privileges is not to say that “I suffer more than you,” but it is to say that “I understand the structural foundation that scaffolds this society so that I may aid in its dismantling.” If we don’t identify the privileges that lift us up and leave others in our wake, there is no way we can make the myth of “equality,” or its more accurate cousin “equity,” a reality.\r\n",
      "tags": [
        "test"
      ]
    },
    {
      "publish_date": "2020-03-06T06:00:15.466Z",
      "title": "The Law of Imitation ",
      "image": "/uploads/grayscale-photo-of-woman-taking-photo-of-round-mirror-3739059.jpg",
      "description": "Imitation is a powerful tool to help a writer find their voice when used appropriately.",
      "body": "Most of what we have learned has been copied from those around us. Every single phoneme of language to the way that we get angry when someone tells us not to get angry has been passed down to us from memorable and unmemorable people in our life. A craft, like writing, is learned through mimicry. By reading and loving and wanting to be the authors we love and admire, whose lines are so beautiful they knock the wind out of us. So, we imitate.\n\n\n\nImitation isn’t stealing. It’s using another person’s voice and perspective to help us get to the crevasse that is our own. We imitate in the hopes we’ll be imitated because it means that people are soaking us up and in return we help them see a piece of themselves a little different. My writing is constructed from the beauty of every storyteller I’ve ever loved before—Carmen Maria Machado, Ada Limon, Kaveh Akhbar, my grandmother, my dad and my cousin. Every person who let me touch a little bit of them and their world disguised as words, breath and paper. I happily consumed them, and they helped me feel a little more whole, confident and vulnerable.\n\n\n\nThe world teaches us how to see the world, and writers and artists are this constant mirror. But, imitating has a limit. Once we’ve sucked up every ounce of life from the words we can muster, we have to let them come through us, by us, for us. We have to take all the tools we’ve absorbed from those before us and channel them to find ourselves. The writing will be horrendous. And, this truth will hurt. But, the search for the written self could never be beautiful. So, we have to write and write and craft its beauty. We’ll know it’s beautiful when we look at the words on the page and say, “That’s me.” Finally, we will have the self that is truly ours, one that we can finally fully share with others.\n\n\n\nThere is nothing more beautiful than being able to communicate our authentic self. Still, people will misunderstand and misinterpret and misunderstand and misinterpret us as sure as dusk and night and dawn and noon. But, we won’t care because the words are ours. The words formed from the love of all those who shared themselves before will hold our writing up like the flaming swords of the cherubim at the garden of Eden. People may even be mad because how dare we love ourself and all the beautiful ghosts before us so much. And, it will hurt because beauty should be revered, but the reality is beauty and seeing beauty and writing beauty will confuse people who see beauty as white light because they’ve never been shown a prism.\n\n\n\nThen, we will care. We’ll be afraid that people won’t like us for what we wrote, and, really, who we are. We’ll be afraid that people will hate us. And, sometimes, they will both dislike us and hate us, but we will remember the story our grandmother told us about the devil counting the hairs on the tip of a cat’s tail and realize we may not have nine lives but even something like a flick of a tail can be a super power and give us a few more lives.\n\n\n\nWe’re lucky we’re writing in some of the most diversely recognized moments in history, but we shouldn’t settle. We’re lucky the ghosts before us had the magic to see that’s what we needed and the retrospection to name what was missing from the world and demand it. It means our ghosts are more complete and truer. Sometimes I think ghosts who haunt have found the wrong person but don’t know it. Writing ghosts who don’t look like us will haunt us in the same way. They aren’t for us. But, we don’t know how to get rid of them or properly use them to find ourselves.\n\n\n\nThere are some voices we aren’t meant to keep. We can get caught in the infinite treasures of imitation that ends up being plagiarism and cultural appropriation. And, sometimes, no one has the courage or care to tell us that our written self is hollow. What was once imitation becomes stolen. To fill a gap or a hole or any metaphor for insecurity that our own story is not enough or the fear of revealing our self is much too much. No one will tell us how bland our words are, but they don’t have to because we’ll have already felt that blandness and deny it exists with more and more writing that is straw.\n\n\n\nOne of the most gracious gifts that artists give us is the ability to see ourselves better. It is a privilege we have to respect and keep from taking advantage. When imitation is used rightly, it is a tool that helps shape our voice into the unique cadence and form that is us."
    },
    {
      "publish_date": "2020-03-27T02:35:14.181Z",
      "title": "Choice and Creating a Better World",
      "image": "/uploads/choiceimage.jpg",
      "description": "We make the choice to be who we want and create the world we want to see.",
      "body": "Every day we make a choice to be who we want to be. Depending on a multitude of factors, our coping skills, our mental states, our level of privilege, and so many others, these choices can be made on a whim or with serious, scraping-the-metal effort. But, there is a choice. When speaking of his analysis of the behavior of those imprisoned in the Nazi concentration camps, Victor Frankl, insightful psychiatrist and author of *Man’s Search for Meaning* himself a prisoner of Auschwitz, observes, \n\n> \"Even though conditions such as lack of sleep, insufficient food and various mental stresses may suggest that the inmates were bound to react in certain ways, in the final analysis it becomes clear that the sort of person the prisoner became was the result of an inner decision, and not the result of camp influences alone. Fundamentally, therefore, any man can, even under such circumstances, decide what shall become of him—mentally and spiritually. He may retain his dignity even in a concentration camp.” \n\nFrankl argues that a person determines who they are and can become even under the direst circumstances. Because of this, real freedom lies not in the external choices we encounter, but the internal choices to be the person and create the change we want and need.\n\n\n\nDuring the few months I spent working with the teens in the juvenile hall, the idea of choice was a huge topic. Whether they had a choice or didn’t. Whether they would or would not make the same choice again—the one that got them there in the first place. Whether they would make similar or different choices when they got out. It was all about choices. Sometimes my co-facilitator and I would leave the discussion feeling a mixture of frustration and hopefullness that the young men were so close to acknowledging their power to change by holding themselves accountable to the choices they could and can make to be different every day.\n\n\n\nMy brother and I were having an argument about choices just today. He prefers to have choices from different types of health insurance to brands of cookies. Even if this choice is an illusion—[like a handful of companies control or own everything we buy](https://www.businessinsider.com/companies-control-everything-we-buy-2017-8). Whereas, I don’t need these kinds of choices. I’d be happy with one type of health insurance or a single brand of cookies. These arbitrary choices don’t lead to any amount of real freedom, but my brother disagrees. These choices are precisely what freedom means to him. In reality, this argument was more about control than choices. But, control, as we’ve seen with how our world of comfort and privilege has been upturned by COVID-19, is also an illusion.\n\n\n\nThe only control we have, the only choices we can make is over and for ourselves. In librarian and activist Stacy Russo’s inspiring anthology *A Better World Starts Here: Activists and Their Work*, I’ve been obsessed with the two epigraphs that open the text. The first is from writer-activist Grace Lee Boggs, “We have the power within us to create the world anew,” that is followed by poet-activist June Jordan, “We are the ones we’ve been waiting for.” Behind choice there is power, and, often, privilege. It’s impossible to disconnect these terms from the other. The greatest freedom, then, is how we choose to see the world. It’s the whole glass half-empty, glass half-full argument. More contemporarily, it’s having a growth versus a fixed mindset. Frankl, Russo, Boggs and Jordan have chosen to find hope amidst the uncontrollable and sometimes terrible world. To fight the good fight with their voices and words and art. \n\nEach of us have the power to “retain \\[our] dignity” to “create the world anew.” We don’t have to wait for the right person to come along. We’ve been here waiting all along to make that choice and hold ourselves accountable for the world we want to see. And, it’s a hard choice to say, “I’m not going to wait around for someone to step up any longer,” but it’s the necessary choice as we face countless injustice. Everyday make the kind choice, the hard choice, the caring choice, the responsible choice, the people-first choice, the community choice, the hopeful choice. Because choosing not to do anything at all is also a choice. One you’ll have to live with every day."
    },
    {
      "publish_date": "2020-04-16T03:23:59.212Z",
      "body": "We live in a world that’s been constructed by those who came before us. We all live in a dream world made powerful by the belief of individual dreams says Don Miguel Ruiz in self-improvement guide *[The Four Agreements](https://bookshop.org/books/the-four-agreements-a-practical-guide-to-personal-freedom-9781878424310/9781878424310).* We’ve been adapted, or, more precisely, indoctrinated, to blend into a world by those who instruct us. The same ways those who came before them were also taught. In this equation, education is as much to lineate as it is free. Even though we hear this idea in many different iterations,\n\n\n\n> “Society, unlike biochemical processes, does not escape human influence. Man is what brings society into being” (Frantz Fanon, *[Black Skin, White Masks](https://bookshop.org/books/black-skin-white-masks-9780802143006/9780802143006)*).\n\n\n\n> “…my daughters are the light of my life, it’s just that I thought after all these sacrifices, at least my family would be close, but it surprised me to discover that my daughters lived in their own worlds” (Laila Lalami, *[The Other Americans](https://bookshop.org/books/the-other-americans/9781524747145))*.\n\n\n\nit feels like some kind of epiphany to realize we each live in our own “dream,” a tight choreography of the larger social “dream.” So much so that if we wanted to break away, a path is hard to find. The imagination is limited to what has come before, and some dreams fail to take form if there are few cultural scripts to support it. Yet, we strive by moving through the *mitote*, or the fog of perception, and building the railing to our own dreams.\n\n\n\nIn Lalami’s novel, *The Other American*, one of the main protagonists, Nora, is constantly accused by her family of “having her head in the clouds,” she’s too dream-y. She lives in a world that is unreachable to her family. Because they don’t understand, she’s accused of living in a fantasy. The *mitote* is easy to see when it conflicts with one’s own *mitote*. Some fog is like oil and water. They push back and refuse to blend—I did learn though that a little mayonnaise will help the oil and water hold, but I don’t know how to find that type of dream emulsion. So, Nora is constantly reminded how her choices don’t fit into her family’s dream.\n\n\n\nWhen the world’s dream overcomes me, I feel trapped by its fog. I must do this and not that. Sometimes the shame or fear of mistakes follows me around. I’ve learned to keep it at social distancing reqs, but if I drop my guard, it’ll overtake me. My body will fill with the electrifying effects of anxiety, and I’ll replay the moment over and over in my head trying to identify where I went wrong like I’m trying to burst one of those impossible fair balloons with a dart. I worry that I’ve said the wrong thing. Worry that I don’t know what that wrong thing even is. I imagine what everyone is thinking of me because of it—to clarify, none of it good. The shame weighing down my stomach like my cat drops to the ground so he doesn’t have to leave the room. Why they love it, I have no idea. Why this weight follows me, I have an idea. Like Nora, I’m trying to live in a dream that wasn’t designed for me.\n\n\n\nI don’t think it’s too far of a shot to say that the world’s dream is falling apart—obviously the first-world American dream because that’s the one that I collide with daily. And, like identifying where I went wrong, it’s disgustingly satisfying to see the points of failure in our systems exposed and raw. Disgusting because so many people who don’t deserve to pay for these failures will, and so many people who deserve to pay won’t—as Ava DuVernay's and Michelle Alexander's incredible works have so kindly made clear for the world. The hard truth is that some dreams are lies, and the American Dream has always been such.\n\n\n\nOne of my favorite ways that Ruiz says we can change our lives and create our own “heaven” is by confronting death constantly. There is literally an app for this, see “[WeCroak](https://www.theatlantic.com/magazine/archive/2018/01/when-death-pings/546587/),” which was obviously a product of safety and comfort pre-COVID-19. Right now, we’re faced with so much death. Real death and tragedy and pain. Metaphorical death of society’s dream as it’s tries to hang on. The numbers of cases and deaths continue to climb. Places like Wal-Mart have to barricade their doors and let only a handful of folks in at time to allow for proper social distancing, essentially protecting us from ourselves and our choices and the heavy veil of *mitote*.\n\n\n\nThough we live in a constant dream state, this dream is oftentimes beautiful, much more than I allow myself to see. There are people going out every day to make sure students have their two meals a day even if school is out. There are people hosting fundraising campaigns on Twitter to support those in need. There are people counting us at the doors of Wal-Mart. There are nurses and doctors using garbage bags to protect themselves and continue doing the saving. The problem and solution lie equally within us, “The prognosis is in the hands of those who are prepared to shake the worm-eaten foundations of the edifice.” Here, again, is Fanon coming through by holding colonial dreams accountable and reminding us we have the power to shake the world anew if we’re willing to grab the edges of this dream’s decaying foundations. So, let’s grab and shake by donating and voting and resisting and loving and holding all the while still dreaming from our vantage within the clouds.",
      "image": "/uploads/henrik-donnestad-dcd0_mzlcsg-unsplash.jpg",
      "title": "With Our Heads in the Clouds: Creating a New Dream for the World",
      "tags": [
        "dreams",
        "society"
      ],
      "description": "We live in a world that’s been constructed by those who came before us..."
    },
    {
      "publish_date": "2020-05-06T01:23:02.772Z",
      "title": "Loss and Uncertainty: A Meditation Under Quarantine",
      "image": "/uploads/k-mitch-hodge-iqsag9zv2e0-unsplash.jpg",
      "description": "A meditation on loss and uncertainty during quarantine.",
      "body": "Ever since the tragic death of my dad at 17, I thought I was comfortable with uncertainty. Life only surprising when I don’t know to expect its sudden lane changes. Through all the twists and turns that is COVID-19, what I’m struggling with is precisely the uncertainty. The uncertainty isn’t the virus itself[. It’s the president lying to the people’s face](https://www.theatlantic.com/politics/archive/2020/04/trumps-lies-about-coronavirus/608647/); [it’s the people willing to risk theirs and others lives for touch ups and pedicures](https://www.nytimes.com/2020/04/16/us/coronavirus-rules-protests.html); it’s the uncertain certainty that we’ll let each other down when we need each other the most; it’s the unknown of how long my present comfort will persist. No matter how much we try to avoid and minimize uncertainty in our lives, it’s inevitable.\n\nI don’t want to say that life is or will betray us because it’s our culture that hasn’t been honest about what life really means. Our society has embedded this myth of safety as if we can stop life from intervening. And, when it does, like the sudden death of my dad who was electrocuted on a hot day in July 2009, we’re devastated. Our lives are heaved into a fast-moving river when we thought there was only the calm waters of the shore. We’ve gotten so comfortable we think that life is trying to teach us a lesson when life is just doing its billion-years-old thing. We just don’t know how to handle it—made evident as we struggle through the uncertainty of the day-to-day under quarantine.\n\nIn Pema Chödrön’s essay, “The Facts of Life: Impermanence,” from *[Comfortable with Uncertainty](https://bookshop.org/books/comfortable-with-uncertainty-108-teachings-on-cultivating-fearlessness-and-compassion/9781611805956)*, she claims, “That nothing is static or fixed, that all is fleeting and changing, is the first mark of existence…It means there’s loss as well as gain. And we don’t like that.” I think of my life in two periods: Before Death and The After. Before Death, I experienced the death of others, but the reality of my own and my loved ones’ mortality never really found a tether in my everyday. It never bubbled into thoughts that would suddenly remind me how mortal I am and how death could happen upon me at any moment. Since I felt the hard loss of my dad when my mom cried, “He’s gone, Allyson,” and unknown to my then self, I’ve also experienced many gains. Education, friends, experiences, love, jobs, fur-children. So much so, that even if the burning of that July day has only barely faded, I’ve forgotten what loss really means as I sit again at the edge of so much more.\n\nOne poignant American problem is that we’ve internalized power so deeply we think we’re invincible, the itself viral notion of “[American Exceptionalism](https://www.washingtonpost.com/outlook/2020/05/03/next-victim-coronavirus-american-exceptionalism/).” As Chödrön says, we think “we might miraculously escape the truth of impermanence,” and I’ll admit that death doesn’t hover over me quite the same way as it used to either. Under the perception-twisting guise that is American Exceptionalism, humility doesn’t exist. It’s all ego. We think we’ll come out of every situation unscathed. And, because of this hubris, [over 70,000 people have died ](https://www.aljazeera.com/news/2020/05/world-coronavirus-death-toll-exceeds-250000-live-updates-200504231301555.html)and [our many politicians are willing to sacrifice more for the sake of profit and another term](https://www.theatlantic.com/health/archive/2020/04/why-georgia-reopening-coronavirus-pandemic/610882/). Humanity is not bestowed upon us universally. It never has. I won’t say it never will because I still believe in hopeful intention, but between the reality of this life and that utopic dream is a huge channel to wade. And, in a crisis like today’s, it feels like we don’t even know how to swim.\n\nPart of learning how to swim is finding comfort in being uncomfortable and uncertain. Chödrön is advocating for the Buddhist approach to life that moves away from escaping the reality of impermanence that surrounds us, from aging to death, to “the ordinary and obvious truth of change.” Among the avalanche of issues that are burgeoning a daily reveal, I’ve been reminded that loss is a reality of life. There is no escape from this reality. But, we can allow ourselves to feel anxiety, grief, frustration, fear. When we feel the swell or hollowness of these emotions arise, we can name it, feel it, let it live in our bodies and release it from our bodies. Though our lives are full of uncertainties that can overwhelm us into immobility, we can let these emotions complete their cycle. Leaving us with one certainty, that these feelings and this reality will pass."
    },
    {
      "publish_date": "2020-05-26T01:59:52.625Z",
      "title": "Storytelling: A Lesson Learned from Family",
      "image": "/uploads/two-red-and-white-labeled-books-762686.jpg",
      "body": "Growing up, I rarely read books at home. We didn’t have bookshelves or cases. I don’t even know if my parents have a favorite book—I rarely saw them reading anything other than bills or work documents. Sometimes though, my dad did read hunting and motorcycle magazine as he waited for my or my brother's doctor’s appointments. My mom works in an office, so reading happens, but rarely of books. And, I always think about my grandma, who I’ve never heard speak a full sentence in English, reading the all English *Desert Sun* every single morning with coffee in her small, white cup trimmed with gold. Even though books weren’t prevalent in my homes, our days were filled with stories.\n\n\n\nI love family gatherings. The way my aunts and cousins and grandma sit around and talk about people and memories older than me. The ways they create the scenes and dialogue made me realize the past is not so far away after all. The people live through their voices. Whether they are real or characters, they are alive. At the edge of their words, the magic surges, pull us in and we laugh from its power. Everyone connected like we’d been lassoed.\n\n\n\nOne of my favorite stories is about my great grandfather, who died way before I “was even a thought”—as my dad would like to timestamp memories before my existence. As my grandma likes to tell it, my great grandpa would get so drunk his nose “se ponía chueca.” It’d begin to slant on his face as if it was loose. Twisting more and more on his face as the drinking deepened. One night, he and his neighbor and my still-young grandpa were coming back from the bar. Flying up the dirt road full of the looseness and carelessness of too much liquor. When my great grandpa, nose chueca, turned a corner too fast, the passenger door flew open from their inertia and his friend flew out. Rolling in the dirt. When my great grandpa went back for him, he said, “¡Me tumbaste pendejo!”\n\n\n\nI laugh just writing about this. Imagining my straight-faced grandpa with his equally straight-faced father both of their noses chuecas and drunk and nowhere near straight-faced. A false memory seeded and entwined with all the others.\n\n\n\nPart of my love for my family’s stories is that people will be remembered as who they were. Whether they're alive or dead, their stories will be tainted with idealization, especially the kind which can frequently happen with death. If you're a shit-talking drunk, then you're a shit-talking drunk. That's it. So, if you know my family, we all know this about you.\n\n\n\nThere is something so beautiful about maintaining this humanness. This is precisely how everyone I know has been able to live even if they’re not alive. The way I can still hear their voices or, even better, their laughs. This is precisely how so many histories, despite so many efforts to erase it, have been able to live. \n\nRight now, we’re living through a historic moment, and we can already see the revisions to our story taking place. People have died and are continuing to die, but we’ve done a “great” job in handling this pandemic. Everyday our stories play a huge part in maintaining the truth. Stories keep the past alive and the future from being distorted. Without my family, I don’t know if I would’ve realized either.",
      "description": "Storytelling helps keep the past alive and keep the future from being distorted."
    },
    {
      "publish_date": "2022-12-28T00:10:39.656Z",
      "title": "An Overthinkers Journey to Resilient Thinking",
      "image": "/uploads/kenny-eliason-2rrq1bhpq4e-unsplash.jpg",
      "description": "The difficult part about overthinking is learning how to turn one’s mind off, but it is possible by learning how to be in the moment and reframing intrusive thoughts.",
      "body": "The difficult part about overthinking is learning how to turn one’s mind off. During the cold last few weeks, I’ve turned to yoga as my morning workout routine. It’s been a tough transition. When the weather was warmer, I’d run. Thinking a great distraction from the running part, but it was also a distraction from enjoying the beauty of the morning. I had to train myself to notice something new during each run. The old man on the corner uprooting all the beautiful chuparosas. The wooly cacti blanketed by lengua de suegra. The kittens huddled together for warmth as they waited for the morning sunlight. Without nature to distract me while doing yoga, I’ve had to begin training myself away from intrusive and even productive thought to instead listen to my breath and focus on my body. [Overthinking](https://health.clevelandclinic.org/how-to-stop-overthinking/) generally has a negative connotation, but, once I learned to be present, I was able to begin reframing my thoughts and build a more resilient mindspace. \n\n \n\nThe innerness of my mind has always run deep, and it continues to be a place to lose myself. Frequently, I think about my father. Who would he be today? Who would I be? How would my family have been different, better, closer to whole? I love who I am today, which is due in large part to his death, but I would also trade everything I have for one more day with him. I dreamed of him recently for the first time in what’s been years. I was in a huge conference center trying to find my room. As I walked into the room behind two women, I saw a man sitting outside the room hide his face. This sudden movement drawing my attention. As I turned and looked, it was my dad, hand shielding his eyes and shoulders sinking deeper into the chair. Running over, I yelled, “Dad!” I jumped in his lap, hugged him, and cried. Realizing my brother was also somewhere at the conference, I ran to find him determined to share this joy. We unfortunately ended up not making it back to my dad before I woke up. I’ve noticed my dad hasn’t visited me. Sometimes, I even ask him why out loud. After this dream, I realized he’s always been there on the edges. This fortunate time he messed up. I could see it on his face. \n\n \n\nMeditation has never worked for me, so I’ve turned to stretching and exercise to be present. Focusing on my body—the pain and fatigue it’s feeling, the surprise when it can or can’t do something—clears my mind. The present is so elusive. It almost feels like it’s unending until I reflect on what’s past. The death of my dad being a significant marker in the passing of time. Everything traces back to that moment. Being in my body helps ground me. It's a place where the past dissolves away for a moment. If there’s any anxiety from pending worries, exercise or stretching will help with that, too. I’ve found a way to give myself time to just exist, a sacred moment the construct of this world has done it’s best to lessen. This grounding experience has allowed me to learn how to practice \"[grace](https://dictionary.cambridge.org/us/dictionary/english/grace)\"—something a therapist mentioned to me years ago.\n\n \n\nLearning to live within the borders of my body has allowed me to step back and give myself the understanding I deserve. Where I once would’ve spent hours mulling over something I said or talking too much, I can redirect these thoughts to something more positive: The laughter around the fire, the delicious food, the overall joy of the moment. Though my mind is tempted to fall into the same patterns of harmful overthinking, I am now able to redirect this overthinking into positive reflection and can turn these moments into fodder for pleasant refuge.",
      "tags": [
        "thinking",
        "reflection",
        "learning",
        "nostalgia",
        "meditation",
        "journey"
      ]
    },
    {
      "publish_date": "2023-01-03T04:48:40.425Z",
      "body": "Time has an invariable hold on us. As many of my fellow humans, I have a complicated relationship with time. From our place in the universe, time is expansive, unfathomable. For us humans, this expansiveness is challenging to grasp, and the reality becomes surpassed by our perception of time: Time is confining and frightening in its limitations. Our whole lives revolve around the awareness that the life we know will at some point end. Adding to the complexity, our understanding of time is heavily influenced by social factors, beliefs, language, age, societal frameworks, like work. At the cusp of the new year, it is a unique time in western culture where reflection on both the past and the future are built-in and encouraged. I say “unique” because the busyness of our world is determined to discourage moments of reflection. Most importantly, the new year is a time filled with hope—an occasion to start anew—where time becomes malleable. An opportunity to direct or redirect where we’d like to go and who we’d like to become. \n\nIn the *Live Science* article, “[What is Time?](https://www.livescience.com/what-is-time),” writer Paul Sutter defines “time” as “the apparent progression of events from past to future.” I love the word “apparent” within this definition. “Apparent” alludes to the idea that time is a perceptual phenomenon; one that only appears to be true. The interesting part about the word “[apparent](https://dictionary.cambridge.org/us/dictionary/english/apparent)” is that it can be defined as both “able to be seen or understood” *and* “seeming to exist or to be true.” In Sutter’sdefinition of time, it most likely refers to the latter. Yet, thinking of Sutter’s definition against both of the Cambridge Dictionary’s definitions of “apparent” point to the paradoxical relationship we have with time: Time *seems* to exist, and, because this seeming existence is recorded as we move from past to future, we can understand it (though we know this is often untrue). During the new year and other important life events, time in all its contradictions becomes a focal point and catalyst for change. Something very much real. Something very much capable of inspection and dissection in search of understanding. In the hopes this understanding might give us some insight to the larger “why” of our lives and possibly a glimpse into the future.\n\nEach unknown step in the future becomes immediately visible for a moment of the present before it just as instantly becomes assigned to the past. This continual progression from future to present to past becomes a communal layer of time that we come to know as our life. In *\\[The Many Daughters of Afong Moy](*https://bookshop.org/books/the-many-daughters-of-afong-moy-9781432897604/9781982158217*)* by Jamie Ford (see [book review](https://www.allysonjeffredo.com/the-bookest)), there is a beautiful scene where one of the characters, Faye, is speaking to a Buddhist monk, Shi, about time, (re)birth, and the interconnectedness of life:\n\n> “‘If you plant an acorn,’ \\[Shi] said, ‘it may grow to become an oak tree. Yet there is no acorn within that wooden body. Has the acorn been reborn as a tree? Or does the acorn grow to be something else entirely? It’s my belief that the acorn and the tree are an idea, spread out over an abstraction of time. And if that new tree, when fully grown, drops one acorn or one hundred, or a thousand, or ten thousand, that idea keeps progressing as this thing we call life.’”\n\nShi’s notion of life as a boundless idea across time resonates with the malleability that our lives and time acquire during the new year. During this time, one year officially ends and another begins. At this intersection, we have the opportunity to change the trajectory of our life, i.e. “[New Year, New Me](https://www.instagram.com/explore/tags/newyearnewme/?hl=en).” Unlike an acorn, humans have some autonomy to determine our next form, some control over the idea of who we are. This, of course, is also determined by the power and privilege of our social identity. Time, and its perception, can be evaluated and shaped, and, therefore, influences the construction of our past, present, and future.\n\nThe new year is time for rest, reflection, and contemplation. At this juncture, time slows down. I can reflect on who I was, who I am, and who I want to be. There is immense freedom in choosing to explore, to decide on growth, and to turn vision into reality. Yet, no matter how much I grow, the acorn kernel idea that birthed me is still a part of me. Now, I am in the process of metaphorically spreading acorns along the way, small evidences of my existence—like this essay or my hair in a random gas station bathroom or the feeling of goodness in another. Here, on the second day of the new year where it feels both the same and new, I have hope. I have a kernel of vision for the future that I will watch grow over the next year until it is difficult to determine where the acorn ends, and the oak’s wooden body begins.",
      "description": "Time has an invariable hold on us, but, thanks to the power of perspective, we're able to control time in small ways to find hope and make positive change in our lives.\n",
      "title": "The Invariability of Time and the New Year",
      "image": "/uploads/denny-muller-cruqp9hwnac-unsplash.jpg",
      "tags": [
        "blog",
        "newyear",
        "time",
        "change"
      ]
    },
    {
      "publish_date": "2023-01-09T03:05:41.659Z",
      "title": "Pursuing Financial Independence to Meet My Life Goals",
      "description": "Obtaining financial independence is one key way to meet major life goals.",
      "image": "/uploads/2023-mood-board.png",
      "body": "With a whole week under 2023’s belt, goals are on my mind. I’m embarrassed to admit that even though I’m always emphasizing the importance of goals in my professional life, they’re incredibly difficult for me to personally manifest. I try to take my life day by day and intuit decisions, which is in no way a sound approach to life management. “Feeling” for the right choice is also becoming harder the older I get as opportunities grow but consequences become riskier. Spurned by entering my 30s in the last few years, I’ve become more invested in my long-term life goals:\n\n* Semi-retire by the time I’m 40\n* Buy a few acres of property\n* Be able to easily support my family \n* Have the choice to do that which I love \n\nThe underlying basis for each of these goals is, of course, money. Even the last goal requires a certain level of privilege and financial security. More importantly, I get stuck on how I make these goals happen. In my research, the answer is [financial independence](https://www.investopedia.com/articles/personal-finance/112015/these-10-habits-will-help-you-reach-financial-freedom.asp).  My short-term goal for this year is to continue exploring, practicing, and learning how to make smart financial choices as a millennial with very few safety nets.\n\nThe prospect of building wealth is intimidating and relies on so many external factors. According to a *Washington Post* article I read during the pandemic, “[The Unluckiest Generation in U.S. History](https://www.washingtonpost.com/business/2020/05/27/millennial-recession-covid/),” millennials have experienced significant socioeconomic tragedies like 9/11, the Great Recession, a global pandemic, the ensuing recession, a stagnant minimum wage, exuberant housing costs, and so many other factors that will impact millennials “in the form of lower earnings, lower wealth and delayed milestones, such as homeownership” for the rest of our lives. The younger generations, like the Zoomers, may be even worse off. This means that the overall financial success millennials and younger generations can achieve is and will be significantly lower than previous generations despite the exorbitant rise in costs and expenses. \n\nAnecdotally, I’m living the acute difference between the economic access of my parents as Baby Boomers and my own as a millennial. My parents married in their late 20s. Soon after they were married, they were able to buy a house and have a few kids (my brother and I). Both my parents graduated high school, but neither went to college. Starting from a young age, they worked in various jobs in agriculture. At some point in their 40s, my parents decided they needed to find work with better hours and better benefits, and they both ended up at the local school district. Because of these great moves, my mom still made more than me (with a master’s degree) until recently. My dad did too, even though he died in *2009*. I’m unmarried, don’t own a home, don’t have kids. In many ways, I see myself in these statistics and feel “behind” both socially and economically.\n\nIn the pursuit of financial independence, a few options to build wealth I’ve found for those without the privilege of a familial safety net like myself is generating multiple income streams and investing. I’m ethically torn about actively participating in capitalism, but [when only 48% of women invest compared to 66% of men](https://www.nerdwallet.com/article/investing/survey-less-than-half-of-women-in-u-s-invest-in-the-stock-market), it’s also a way to use the tools of the system by individuals it didn’t intend. The amazing thing about the internet and social media is that a lot of financial information is accessible online. I’ve made sure to invest in my employer’s investment options, like a 401k, and I also invest on my own in a Roth [Independent Retirement Arrangement](https://www.irs.gov/retirement-plans/individual-retirement-arrangements-iras)(IRA) and a [brokerage account](https://www.nerdwallet.com/article/investing/what-is-how-to-open-brokerage-account). However, financial experts, like [financial advisors](https://www.nerdwallet.com/article/investing/what-does-a-financial-advisor-do?trk_channel=web&trk_copy=What%20Is%20a%20Financial%20Advisor%2C%20and%20What%20Do%20They%20Do%3F&trk_element=hyperlink&trk_elementPosition=0&trk_location=PostList&trk_subLocation=image-list), are definitely a good option to help get one’s finances on the right track—something I’m working on at the moment. With the rise of investment apps like Robinhood, Fidelity, and Vanguard, we actually have access to personally managed investment opportunities, which can be risky but can also save money in the long run. Money stuff, especially for those of us who haven’t had much or any financial education, can be really complicated. So, learning and getting help is crucial for success.\n\nOver the last few years, I’ve determinedly developed my long-term goals, have started following money folks, and have been reading as much as possible in the pursuit of financial independence. I’ve calculated my [F.I.R.E.](https://time.com/nextadvisor/financial-independence/what-is-fire-financial-independence-retire-early/) number, and, now in 2023, I’m working to keep in control of my budget, maintain my emergency fund, and invest what I can—especially with another [recession looming](https://www.bloomberg.com/graphics/2023-investment-outlooks/). Hopefully, within the next 10 years, I’ll have carved a visible path to life this me has envisioned. Building wealth and achieving financial independence is a slow process. With consistency, determination, and hope, it is possible. \n\n \n\n## Some of My Favorite Financial Resources\n\nAlong with traditional investing resources linked throughout the post, some of my other favorite investing resources are:\n\n* [Delyanne the Money Coach](https://delyannethemoneycoach.com/)\n* [Yo Quiero Dinero](https://yoquierodineropodcast.com/about/)\n* [The Investing Tutor](https://www.theinvestingtutor.com/)\n* [Arts & Budgets](https://artsandbudgets.com/)\n* [Traveler Charley](https://www.travelercharly.com/)\n* [Bravely Go](https://bravelygo.co/)",
      "tags": [
        "finances",
        "goals",
        "planning"
      ]
    },
    {
      "publish_date": "2023-01-15T21:23:35.140Z",
      "title": "Choosing Ease Can Make Someone’s Day a Little Lighter",
      "description": "Our words and actions can make or break someone’s day. If you have the choice, choose to make someone’s day a little lighter by offering a sense of ease.",
      "image": "/uploads/simi-iluyomade-tvbxqxi5mmo-unsplash.jpg",
      "body": "During a bout of anxiety, indecision, and residual overthinking, my friend said, “Relax. You’re not making this decision out of malice. You’re making this decision for your self-interest.” I felt an instantaneous release of anxiety from her words. It was a reminder and reframe that I needn’t feel guilty about choosing something that’s right for me. Afterall, if we don’t choose what’s best for ourselves, there’s no guarantee someone else will. Bringing ease into someone’s life is a gift. A goal that was quickly added to my growing list for the year. \n\nBecause I love definitions, “[ease](<https://dictionary.cambridge.org/us/dictionary/english/ease).>)” as a verb means, “to make or become less severe, difficult, pleasant, painful, etc.” Each of us has the power to ease someone’s pain, worry, anxiety with just a few words and a subtle shift in perspective. It almost feels like magic. The visceral response I experienced when my friend reframed my situation certainly felt like magic.  \n\nIn the inverse, we also have the power to aggravate, disconcert, stress. There are those that want to instigate, who thrive off their power to ruin one’s day. One of our regular waitresses, Nancy, at our go-to hangout told us a group of older men came in the weekend before and asked for a round of [Modelo Negra](https://www.modelousa.com/es/products/negra), a typical Mexican lager. When she came back to offer the men a second round, she asked if they wanted another “Negra.” One of the men replied, “Did you just call me a n\\*\\*\\*\\*r?” Nancy didn’t know how to reply but tried anyway, “Oh no, my bad. I asked if you wanted another Negra, the beer.” And, this guy responded, “I’m not a n\\*\\*\\*\\*r. You’re a n\\*\\*\\*\\*r.” She told us this story with a laugh to minimize the fact when she heard someone ask for a “Negra,” she felt triggered. She remembered these racist men being unashamedly racist with the sole goal not only to set her at unease but to disturb and to harm. \n\nPeople say, “Sticks and stones,” but I still remember when I was 13 and some boy called me ugly. I remember my aunt, my dad’s own sister, tell my mom just hours after my dad died that my dad was in hell because he didn’t go to church. I still remember a houseless man calling my mom and tía “stupid f\\*\\*\\*\\*ing Mexicans” because they didn’t have any cash to give him. Just like Nancy’s heart will momentarily race when she hears someone ask for a “Negra,” something that’s bound to happen multiple times a day every day she works, reminding her of these racist men. And, what else could I say to Nancy but, “I’m so sorry you went through this,” a flimsy attempt to put my goal to set others at ease to practice. \n\nIf someone can put me so at ease with words, it’s hard to believe something like what happened to Nancy doesn’t cause permanent breakage somewhere on the inside. Words are not just some elusive things. They bury themselves inside the body with the power to heal, to create, to damage. I know I can’t undo the unease and harm others experience, but the little I can offer is a sense of ease whenever possible. So, every day I make a choice to choose ease.",
      "tags": [
        "essay",
        "ease",
        "choice",
        ""
      ]
    },
    {
      "publish_date": "2023-01-24T01:48:59.755Z",
      "title": "Aging is Scary, but There Are Ways to Cope",
      "image": "/uploads/danie-franco-cezypkdceqc-unsplash.jpg",
      "description": "Aging is scary but taking inventory of the good in life and surrounding yourself with those you love makes all the difference.",
      "body": "I’m scared of getting old. The lines finding their home on my face. The reality of my aging becoming more and more visible. I see the way my almost-93-year-old grandma looks at her hands and says, “Que feas se miran mis venas. Son negras. Antes eran gueritas como las tuyas.” But I think her hands are beautiful, how incredibly delicate her skin is. If I’m accidentally too rough, it tears as easily as wet paper. The lines grow a little deeper as they gently capture the days. I’m so thankful I get to have this time with her. We sit around watching old westerns like *Rawhide*, *Wagon Train*, and *Cheyenne*. She doesn’t speak a word of English, but she always catches me up on what I missed in between visits. Now, I just have to learn to embrace that aging is scary and remember to show myself the same kind of reverence as I go through this inevitable. \n\nClinical psychologist [Meg Jay](https://www.ted.com/talks/meg_jay_why_30_is_not_the_new_20?utm_campaign=tedspread&utm_medium=referral&utm_source=tedcomshare) says that 80% of our most significant life experiences and most impactful life decisions happen by the time we’re 35. As of 2021, the average age of an American was [76 years old](https://www.cdc.gov/nchs/pressroom/nchs_press_releases/2022/20220831.htm). This means that middle age isn’t 50, it’s actually closer to 38, a number only a few handfuls of years away from me. By the time most Americans hit the real middle age, the trajectory of our life has been determined by the choices we made in our 20s and early 30s. A scary thought since most people I know weren’t taught how significant our choices in our 20s are. Did I make the right choices? I have no idea, but I try to trust that my past self did the best she could. If I don’t believe this, I can easily wake up in the middle of the night and waste hours on what could’ve been.\n\nThe people of France recently took to the streets to [protest raising the age of retirement from 62 to 64](https://thehill.com/policy/international/3820260-french-workers-go-on-strike-over-proposed-hike-in-retirement-age/) to keep the country’s pension system stable. Another scary possibility: I might have to work until I die. In a [previous post](https://www.allysonjeffredo.com/overthink-a-blog/pursuing-financial-independence-to-meet-my-life-goals), I talk about my goal to semi-retire by the time I’m 45. After doing some calculations, 45 seemed the most ideally realistic. After recently realizing middle age is not as far away as I thought and seeing what France is going through, I want to focus on bringing this age down to semi-retiring by the time I’m 40. Mostly, I’m scared I won’t get to enjoy my life if I’m working until I die, but this also shouldn’t keep me from enjoying my life now.\n\nJust today I was thinking about a few bad money choices I made that set me back a year of savings. Fortunately, my partner was there to remind me it’s ok. I can dwell, or understand I did what I thought was right then and move on. So, I decided to move on. Maybe that’s another type of reverence that comes with aging: Allowing one’s self the understanding that we’ve done the best we can with what we have. I thankfully love my life and my job, have the privilege to save, and get to do things I enjoy, like writing these blog posts and spending time with my family. Aging is scary, and it never won’t be. \n\nDespite all the unknowns, taking inventory of the good in my life and seeing my grandma each week is a great reminder that as long as I show gratitude for what I have in life and surround myself with those I love it’s a little less scary, which makes a world of difference on hard days.",
      "tags": [
        "aging",
        "fear",
        "coping"
      ]
    },
    {
      "publish_date": "2023-01-27T03:46:35.118Z",
      "title": "Finding Ways to Live When You’re Terribly Busy",
      "image": "/uploads/debby-hudson-vir-kkzl2eg-unsplash.jpg",
      "description": "As the new year excitement winds down and it gets more and more busy, here’s how I’m finding ways to live and go easy on myself.",
      "body": "Every week in January has felt like a month on its own, and there’s still five more days left. This week, though, I started feeling the unappeasable sense of tiredness creep in. The excitement and motivation that came with the new year is wearing off and being replaced by the dread of being terribly busy. My anxiety is also ramping up. I start a new online class Monday, but they haven’t setup my Canvas course. This means I’ll have just three days to get at least two weeks’ worth of content up. The worst part is I haven’t felt like doing anything. As I was scrolling through Instagram instead of the numerous other things I should be doing instead, I thankfully came across a gatha from famous Zen Buddhist monk [Thích Nhất Hạnh](https://thichnhathanhfoundation.org/thich-nhat-hanh) called “[Waking Up](https://thichnhathanhfoundation.org/practice-right-now)” that made me pause and find a moment of repose: \n\n> *Waking up this morning, I smile.*\\\n> *Twenty-four brand new hours are before me.*\\\n> *I vow to live fully in each moment* \\\n> *and to look at all beings with eyes of* \\\n> *compassion.*\n\nFrom the first line, “Waking up this morning, I smile,” the whole gatha is a simple reminder that each day I have the power to set the tone. Instead of dread or anxiety, I can smile and feel gratitude. I should smile and feel gratitude. There are “Twenty-four brand new hours are before me” to live, enjoy my time in this world, and give others the “compassion” they deserve—many of whom are also terribly busy. As always, I’m amazed at the immediate power of words. Just re-reading “Waking Up” while writing this is dissipating my exhaustion from a long day and replacing it with the rejuvenating spark of excitement. \n\nI get to decide how I live each moment. Tomorrow is going to be packed with meetings. I already know I won’t be able to get through nearly as much work as I’d like, but I’ve decided to show love for myself by “vow\\[ing] to live fully in each moment.” I’ve decided that each day I’m going to find ways to be gentler and gentler with myself. I’m going to allow myself to do only what’s feasible in the time I have and be happy with the work I can get done. Tomorrow, I’m going to start my day by reading “Waking Up,” put on my running clothes, and go for a trail run. I’m going to enjoy the cold in my lungs, the sun on my skin, my feet finding their footing in the soft sand, and run my fingers across the striated walls of my favorite desert canyon (pictured below).\n\n![Picture of canyon walls on a desert hike.](/uploads/badlands.png \"The Badlands\")",
      "tags": [
        "living",
        "busy",
        "gratitude"
      ]
    },
    {
      "publish_date": "2023-02-03T05:03:21.750Z",
      "title": "Building a Routine Saved My Mental Health",
      "image": "/uploads/prophsee-journals-wi30grrfbne-unsplash.jpg",
      "description": "Building a consistent and doable routine has helped me lead a happier life.",
      "body": "Building a consistent and doable routine has saved my mental health. It’s the one thing I can credit for having my sh*t together. This month, it’s been my crutch to manage everything I’ve had to do and maintain control of my anxiety. But, until I was talking about getting so much done over lunch with my mom earlier this week, I actually never noticed how impactful and freeing a routine has been on my life. \n\nFive years ago, I would’ve never thought “freeing” and “routine” belonged in the same sentence. I was adjuncting, and my schedule was all over the place. One semester, I was teaching a class until 9:50 pm on Monday a 40-minute drive one way and had an 8:00 am class first thing Tuesday morning a 40-minute drive in the opposite direction. I was only in class about 20 hours a week, but my out-of-class workload was immense. With driving, grading, and regular class preparation, I was working at least 50 hours a week including in-class time. I was *stressed out*, but I felt free because I wasn’t “trapped” in the normal 8-5 grind. \n\nNow, I realize how wrong I was. At my current job, my schedule allows me to have a three-day weekend every other week. My workday starts and ends at the same time each day making it easy to make plans. I have great benefits. Most importantly, I’ve made a routine around work that prioritizes my mental health. My day-to-day routine outside of work has two core components:\n\n1. Self-care activities\n2. Unyielding responsibilities\n\nMy routine is organized to prioritize my core self-care activities, which includes exercise, reading, and one productive personal activity, like writing this blog post or working on my data analytics class. Sometimes I don’t spend more than 30 minutes on any one of these self-care activities, but I’ve done enough of each item to bring me joy. \n\nMy daily routine might be more accurately described as being prioritized around my joy. I’ve intentionally listed self-care activities first because I want to “pay myself first.” It’s so easy to say, “I’ll read tomorrow,” or “I’ll exercise later,” especially when I’m [terribly busy](https://www.allysonjeffredo.com/overthink-a-blog/finding-ways-to-live-when-youre-terribly-busy) and have a long list of competing tasks. But, prioritizing these small moments of self-care are crucial for my mental health, and this is what I’d like most to preserve. I’ve worked for over a decade to manage my anxiety, stress, pain, etc. I don’t want to jeopardize this work. \n\nSecond on my list is unyielding responsibilities. This is day-to-day maintenance to keep my animals and living space in order. I play and clean up after the dogs, give my cats some love, vacuum and mop the house, pick up and wipe down my workstation, do laundry, or other household chores. These are tasks that I don’t like to do, but they are tasks I must do to lay the foundation for clear thinking and comfort. \n\nIf the house and my workspace are dirty, I can’t focus. With a million cats, it’s important that my house smells and feels clean. Every day isn’t manageable. So, I do light cleaning every other day, but it could be more frequently depending on the level of wreckage the animals have left. I also *have to* shower every night. This routine is both unyielding responsibility and self-care because I can’t lay in bed knowing the dirt of the day is still on me, and the relaxation of the scalding hot water signals it’s time for bed. Old me would’ve prioritized these responsibilities over my self-care, but now I will easily leave the vacuuming for one more day to make sure I find time to exercise or read a chapter of my current book.\n\nUltimately, I want to keep fortifying and expanding my mental wellbeing, and a routine that prioritizes self-care has been a huge step towards this pursuit and building my overall resilience. From the moment I wake up, I have my schedule. One I follow as closely as I can each day. I’m incredibly grateful and privileged to have this level of consistency. One I hope is afforded to you as well. I’ve always been afraid of having a boring life, but structure and routine is undoubtedly helping lead a happier one.",
      "tags": [
        "routine",
        "health",
        "wellbeing",
        "wellness",
        "essay"
      ]
    }
  ]
}